{"talks":{"android-in-the-cloud":{"talk":"android-in-the-cloud","track":"android","speakers":["吳天健 (Wu Tian-Jian)"],"begin":"2018-08-12T14:40:00+08:00","end":"2018-08-12T15:30:00+08:00","title":"Android-in-the-cloud, a combination of android-x86 open source project and container technology ","intro":"In COSCUP2017 we introduced “clondroid”, a mobile virtualization open source project developed by ITRI, Taiwan. This year we are going to introduce android-in-the-cloud, an os-level-virtualization technology that enables x86 server to host multiple independent android instances in  containers with resource control feature based on cgroup.  Thru innovative gpu-virtualization every android instance gains gpu’s 3D-acceleration.  In this presentation it’s planned to talk about the project motivation, difficulties encountered , and interesting discoveries.  It’s worthy to mention that we picked android-x86, another open source project initiated by Taiwan’s developer (Chih-Wei Huang), as a stepping stone of android-in-the-cloud. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-android/%2Fcoscup18-android-android-in-the-cloud)","addition":"","language":"漢語 / Mandarin Chinese","difficulty":"Advanced / 進階","audience":"People who are interested in system software / os-level-virtualization / android-as-a-service / container / cgroup technologies"}},"tracks":{"android":{"group":"android","track":"android","communities":["android"],"room":"IB308","title":"Android 開源專案"}},"speakers":{"吳天健 (Wu Tian-Jian)":{"speaker":"吳天健 (Wu Tian-Jian)","name":"吳天健 (Wu Tian-Jian)","intro":"I am a software engineer in data center system software division of ITRI (previous ITRI Cloud Computing Center for Mobile Application)","link":"","avatar":"/assets/s00122-1V6fd4vGhPogbpgK3bcFwH84ZgdFyCJYs.png"}},"communities":{"android":{"community":"android","title":"Android 開源專案","intro":"隨著開源技術的發展與成熟，以及開源社群的活躍，培養出越來越多的本地開源技術人才，加上全球最大規模開源平台 GitHub 的興起，讓更多元化的參與者透過分享、討論、貢獻的過程，使能夠永續共享或創新創造的開源專案得以實現。這股新興開源的能量，儼然已成為各種技術創新的發展策略。台灣雲端物聯網產業協會長期協助推動 Taiwan Open Stack User Group 及 OCP Taiwan 等社群與臺灣產業之互動連結，藉由此次台灣開放原始碼社群聯合推動的 COSCUP 年度研討會，我們將組織邀請在國內成立之新興熱門開源專案代表，分享其專案領域的最新技術進展，進而連結社群開發能量，展現台灣開源創新的堅強實力。 OpenStack: https://en.wikipedia.org/wiki/OpenStack https://www.openstack.org/ Android_x86: https://en.wikipedia.org/wiki/Android-x86 http://www.android-x86.org/","link":"","image":"/assets/logo_irti-1wND1plxWPK5m3o-8GKdud8eKGss5ABOd.jpg"}}}