{"talks":{"building-private-opensuse-cloud":{"talk":"building-private-opensuse-cloud","track":"opensuse304","speakers":["Masayuki Igawa"],"begin":"2018-08-11T11:30:00+08:00","end":"2018-08-11T12:00:00+08:00","title":"Building Tiny Private openSUSE Cloud ","intro":"Recently, public clouds are getting to a majority of \ninfrastructures. For example, using containers, Docker, Kubernetes, \nWeb applications, etc. Of course, public clouds are very convenient \nbecause they are very easy to use and cheap comparing to using \nphysical machines. However, it's sometimes a bit boring for some \npeople who want to know/manage the whole of the things such as physical network, \nstorage, machines, etc. And also, an experience of building a tiny \ncloud with physical machines could be a very good opportunity to \nunderstand computer technologies. Moreover, it's fun for such people \nlike me.\n\nI had built a my own tiny private cloud with openSUSE and OpenStack on \nmy own physical machines. And I'm now using it for some of purposes \nsuch as evaluating new Linux distributions, containers, Kubernetes, \netc. I had allocated the budget around only 50k JPY (500USD) for \nbuilding it. It's quite a cheap to build a *cloud* system, actually. \nHowever, it can be done with open source software and some tricks.\n\nIn this talk, attendees will get to know about the *tiny private \ncloud* how to build, issues/challenges, benefit and the potential \ncapabilities of openSUSE. \n\n----\n* [Video on YouTube](https://youtu.be/qmVsZC31ulY)\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-building-private-opensuse-cloud)","addition":"","language":"English","difficulty":"Beginner / 入門","audience":""}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"Masayuki Igawa":{"speaker":"Masayuki Igawa","name":"Masayuki Igawa","intro":"Masayuki Igawa is a software engineer for over 15 years on a wide range\nof software projects, and developing open source software related to\nLinux kernel and virtualization. He's been an active technical\ncontributor to OpenStack for years. He is also an OpenStack Tempest,\nsubunit2sql, openstack-health core member in mostly Quality Assurance\narea. He currently works for SUSE's OpenStack Quality Engineering team\nto make the open source software better both side of upstream and\ndownstream. He has previously been a speaker at OpenStack Summits,\nLinuxCons Japan, FOSSAsia, Linux.conf.au, OpenStack Days Tokyo, July\nTech Festa, Open Source Developers Conference, SUSECon and openSUSE.Asia\nSummit.","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}