{"talks":{"cjk-issues-of-floss":{"talk":"cjk-issues-of-floss","track":"gnome306","speakers":["DaeHyun Sung (성대현","成大鉉)"],"begin":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:45:00+08:00","title":"Support to Korean language on GNOME and CJK Issues of FLOSS","intro":"In South Korea(Republic of Korea), Korean open source users experience that lack of Korean language support in FLOSS(Free/Libre Open Source Software).\n\nAlso, Due to the complexity of CJKV character input (Chinese, Japanese, Korean, and Vietnamese), CJKV Information Processing and Localizations are challenging tasks.\n\nUnfortunately, FLOSS Developers & Contributors from outside East Asia(such as CJKV) don't know about the language expression & features. also They don't know about many of needs from Local users to improve CJKV localication.\n\nSo far I will introduce how Korean open source developers & contributors & community is supporting Korean Language on Free/Libre Open Source Software in South Korea.\nI’ll talk about how to proceeding with Korean  Input Method Engine related issues in some Korean communities(such as GNOME Korea, KDE Korea, Ubuntu Korea, LibreOffice Korea, etc)\n\nThe Korean language (Hangul[한글]: 한국말/조선말/한국어/조선어; Hanja[한자/ 漢字]: 韓國말/ 朝鮮말/ 韓國語 / 朝鮮語) is an East Asian language spoken by about 80 million people.\nIt is the official and national language of both Koreas: the Democratic People's Republic of Korea (North Korea) and the Republic of Korea (South Korea), with different standardized official forms used in each territory. It is also one of the two official languages in the Yanbian Korean Autonomous Prefecture(연변 조선족 자치주/ 延邊朝鮮族自治州) and Changbai Korean Autonomous County(장백 조선족 자치현/ 長白朝鮮族自治縣) of the People's Republic of China[中華人民共和國, Mainland China]. Also It uses in Japan, Uzbekistan, Russia[It reads “Корё мар” in Russian], Kazakhstan, Kyrgyzstan, etc\nAlso, Korean language uses Chinese characters(漢字). It says “Sino-Korean vocabulary” or “한자어(漢字語 / Hanja-eo)” in Korean.  It is similar to  Japanese Kanji[漢字かんじ].\nSo on FLOSS, you have to consider both Chinese and Japanese as well as Korean and vice versa.\n\nI will also show the difference of Korean language in South Korea and North Korea.\n\nI’ll talk about CJK issues in GNOME, LibreOffice, etc, based on Korean Language. ","addition":"* Audience: GNOME Local Communities & FLOSS CJKV(Chinese-Japanese-Korean-Vietnamese) Contributors & Translator","language":"English","difficulty":"Begineer / 入門","audience":"GNOME Local Communities & FLOSS CJKV(Chinese-Japanese-Korean-Vietnamese) Contributors & Translator"}},"tracks":{"gnome306":{"group":"gnome","track":"gnome306","communities":["gnome"],"room":"IB306","title":"GNOME.Asia Summit"}},"speakers":{},"communities":{"gnome":{"community":"gnome","title":"GNOME.Asia Summit","intro":"GNOME 基金會亞洲委員會在 2008 年成立，旨在通過舉辦 GNOME.Asia 亞洲峰會在亞洲地區推廣 GNOME 項目以及自由開源軟體的理念。GNOME.Asia 峰會與 GUADEC 峰會和 Boston 峰會一起成為了 GNOME 基金會每年的全球三大活動。此前的 GNOME.Asia 分別在北京、越南胡志明、台北、印度班加羅爾、香港和韓國首爾、印尼雅加達和重慶舉辦。 ","link":"https://www.gnome.asia","image":"/assets/logo.bd4e77b-1Js_Q9KUYpPeWdbkR0XLIl1zKCDrbH_jh.png"}}}