{"talks":{"growing-community-with-open-source":{"talk":"growing-community-with-open-source","track":"gnome306","speakers":["Siska Iskandar"],"begin":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:15:00+08:00","title":"Growing Community with Open Source: Mothers and Housewives's GNOME and LibreOffice Training. ","intro":"My current project called Perempuan Sadar Teknologi (Women Awareness in Technology). It is a movement to help, intoduce and teach woman, especially housewives and motherhood to understand the latest technology or nearest technology around them. I believe that technology should give a social impact.\n\nAs housewives, day always start too early and ended too late. They managed the houses but also want to keep up with technology for knowing that it is will bring their child a better future. For some reason, including that their time is not as free as students, they accept this challenge. This movement taken place in Family Welfare Movement (Pembinaan Kesejahteraan Keluarga) to help the housewives and mother to have basic skill on using open souce (GNOME) and Libre Office, knowing that they have so many options to start their laptop.\n\nThis talks cover the step of approaching a local community to start use GNOME and LibreOffice as well as use it on daily basis, the struggle of housewive and motherhood with no experience in using GNOME at all, and their progress to be familiar with GNOME. \n\n----\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-growing-community-with-open-source)","addition":"","language":"English","difficulty":"Beginner / 入門","audience":"GNOME Community"}},"tracks":{"gnome306":{"group":"gnome","track":"gnome306","communities":["gnome"],"room":"IB306","title":"GNOME.Asia Summit"}},"speakers":{"Siska Iskandar":{"speaker":"Siska Iskandar","name":"Siska Iskandar","intro":"From 2011, I’ve been focused for help and contribute on increasing awareness of women in technology especially in Open Source. We help them by teach and introduce them to newest technology or the explain the nearest technology around them. After attending several events about open souce, I joined GNOME Foundation in 2015.","link":"","avatar":"/assets/s00008-1ZKVKo-v6FLpddHs37Q9l7DHWRu37haVc.png"}},"communities":{"gnome":{"community":"gnome","title":"GNOME.Asia Summit","intro":"GNOME 基金會亞洲委員會在 2008 年成立，旨在通過舉辦 GNOME.Asia 亞洲峰會在亞洲地區推廣 GNOME 項目以及自由開源軟體的理念。GNOME.Asia 峰會與 GUADEC 峰會和 Boston 峰會一起成為了 GNOME 基金會每年的全球三大活動。此前的 GNOME.Asia 分別在北京、越南胡志明、台北、印度班加羅爾、香港和韓國首爾、印尼雅加達和重慶舉辦。 ","link":"https://www.gnome.asia","image":"/assets/logo.bd4e77b-1Js_Q9KUYpPeWdbkR0XLIl1zKCDrbH_jh.png"}}}