{"talks":{"having-fun-with-kde":{"talk":"having-fun-with-kde","track":"opensuse304","speakers":["Yan Arief"],"begin":"2018-08-12T15:00:00+08:00","end":"2018-08-12T16:00:00+08:00","title":"Having fun with KDE: create a Plasmoid ","intro":"K Desktop Environment or KDE is one of the most popular in Linux. Many features provided by KDE. This is my favorite desktop environment that I use everyday with openSUSE.\n\nOn this session I will talk about one of the cool features of KDE, namely Plasmoid, a simple script for the plasma engine. I am focusing on writing QML (Qt Modeling Language) script to create a Plasmoid. QML is a user interface markup language. It is a declarative language for designing user interface–centric applications. Inline JavaScript code handles imperative aspects.\n\nOn this talk I will explain how to create plasmoid as RSS feed reader, for example fetching RSS feed of openSUSE.id blog. This feed will be displayed on desktop if the blog was updated. Plasmoid will send a notification on desktop.\n\nI will explain how to write QML code using Qt libraries, compile the plasmoid, install it on the desktop, and also give tips and tricks using QML to create other Plasmoid. \n\n----\n* [Video on YouTube](https://youtu.be/SaEs1Qp86v4)\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-having-fun-with-kde)","addition":"","language":"English","difficulty":"Beginner / 入門","audience":""}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"Yan Arief":{"speaker":"Yan Arief","name":"Yan Arief","intro":"Linux System Administration","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}