{"talks":{"jogja":{"talk":"jogja","track":"opensuse201","speakers":["Estu Fardani"],"begin":"2018-08-11T14:45:00+08:00","end":"2018-08-11T15:15:00+08:00","title":"How Jogja Become City of GNU/Linux User Friendly ","intro":"I came in to Jogja, March 2009 for Bachelor Degree of Computer Engineering at UIN Sunan Kalijaga and became GNU/Linux user 6 month later since release of Ubuntu 9.10 Karmic Koala.\n\nAfter 10.04 Release, I am only use GNU/Linux as my operating system on my study, although not many course use GNU/Linux on procces. Latter, I joined GNU/Linux Study Club on my campus, and start learn deeper on GNU/Linux.\n\nJogja is known as a center of education (City of Students) because almost 20% of its productive population is students. The city is colored by the various background of students that came from various regions in Indonesia. Jogja has private and public/state universities. Jogja have more than 16 universities which have computer related majors. Each campus have similar GNU/Linux Study club. And each month all GNU/Linux study club held regular meeting. Each meeting will talk about GNU/Linux technical or non technical related and held on different location.\n\nFrom this background, education about GNU/Linux on University become common things. Students start using GNU/Linux base what their need for their study. Many campus often have GNU/Linux Repository, event ther GNU/Linux derivative distribution. Each campus have different fan of distribution too. I join this community until I graduated from my Campus at 2014.\n\nThis habit they keep up to the next office. Why? Because now, Jogja move from city of education to city of startup. Because more than 10 big startup create Developer Office on Jogja. And many new startup born everyday.\n\n2018, GNU/Linux community in Jogja did not have bigger fans like ten years ago. But every startup still using GNU/Linux for their development and service what their made, even using all open source tools in development tools.\n\nIn this talk, I will present what keys point to make GNU/Linux became common things on Jogja. How it feasible to implement on other city or other country? \n\n----\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-jogja)","addition":"","language":"English","difficulty":"Beginner / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Estu Fardani":{"speaker":"Estu Fardani","name":"Estu Fardani","intro":"Estu Fardani is currently working as DevOps in Indonesian local startup. Doing daily mentoring fullstack development for Binar Academy. He has extensive experience in all aspects of managing event for local, national and international. Active as contributor for BlankOn Project for make BlankOn Linux, one of linux distribution from Indonesia.","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}