{"talks":{"libreoffice":{"talk":"libreoffice","track":"opensuse304","speakers":["Edwin C. L. Lee"],"begin":"2018-08-12T13:30:00+08:00","end":"2018-08-12T14:00:00+08:00","title":"LibreOffice The Swiss Army Knife of Document Creation ","intro":"I will be discussing LibreOffice and Open Document Format (ODF) at an introductory level. Both initiatives are backed by The Document Foundation (TDF), a non-profit organization in Germany. LibreOffice is a free and open source cross-platform office application suite, it is available for a number of operating systems, such as Windows, MacOS, and Linux. Additionally, as a truly globalized application, it is available in many different languages of the world. It is used daily by tens of millions of people. I will also be talking about the improvements in LibreOffice Version 6.1. Furthermore, I will be demonstrating a number of interesting usages of LibreOffice in creating documents such as product catalogs, e-books, and PDF forms. Participants will gain a good understanding of what LibreOffice is about and how they can contribute to its community. Participants will appreciate the diversity of documents that can be created with LibreOffice through the live demonstrations and how easy it is to learn. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-libreoffice)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"Edwin C. L. Lee":{"speaker":"Edwin C. L. Lee","name":"Edwin C. L. Lee","intro":"I included the following bio with my talk submission:\nI am a seasoned technology solutions consultant, with experiences ranging from enterprise systems, such as SAP  to innovative greenfield software. My previous employers include IBM and Intel. Currently, I operate a software consultancy based in Hong Kong. In many of the solutions I design and implement for my clients, the use of open source software is a key component. I am a part of the LibreOffice marketing community.","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}