{"talks":{"modern-network-servers":{"talk":"modern-network-servers","track":"kernel","speakers":["Philip Paeps"],"begin":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:40:00+08:00","title":"Modern network servers ","intro":"While the Intel x86-64 architecture is undisputedly market leader in the \nserver space, several vendors have started introducing ARM64 boards. \nThis presentation examines the suitability of ARM64 server boards for \nnetwork servers. In particular, we look at the workload of a \nmoderate-size ccTLD DNS zone (.dk) and how it would perform on ARM64 \nrunning FreeBSD.\n\nWe consider the viability of the ARM64 platform from performance and \nperformance/power perspectives. While ARM64 is definitely slower than \nIntel on many workloads, it performs at least as well or better than \nIntel on workloads that are interesting to the internet community. \nNotably DNS is a very appropriate workload for ARM64. ","addition":"* Audience: Systems administrators, operating system enthusiasts","language":"English","difficulty":"Begineer / 入門","audience":"Systems administrators, operating system enthusiasts"}},"tracks":{"kernel":{"group":"kernel","track":"kernel","communities":["kernel"],"room":"IB202","title":"Kernel & Coding Serfs & System"}},"speakers":{"Philip Paeps":{"speaker":"Philip Paeps","name":"Philip Paeps","intro":"Philip Paeps is an independent consultant and contractor based in \nBelgium. He provides research and development on low-level software and \noperating systems, particularly in an embedded or real-time context.\n\nHis main interests are bootloaders, device drivers and high-performance \nnetworking. He can also be convinced to teach courses and workshops on a \nvariety of networking-related topics.\n\nIn his so-called free time, Philip is a FreeBSD committer contributing \nmainly to the kernel and a member of the FreeBSD security team. He was \none of the main organisers of FOSDEM, the largest annual open source \nsoftware conference in Europe, from the early 2000s until 2015. He \ndenies having any involvement with amateur radio or tabletop role \nplaying games.","link":"","avatar":"/assets/s00017-1YbmIVXa36h4Izwe_Pc3Cgr9spj3CiDXv.png"}},"communities":{"kernel":{"community":"kernel","title":"Kernel & Coding Serfs & System","intro":"本議程由 Taiwan Linux Kernel Hackers、新竹碼農聚會、Cat System Workshop 三個社群聯合徵稿，內容包含系統、優化、與其他碼農相關討論","link":"","image":null}}}