{"talks":{"newton-project":{"talk":"newton-project","track":"blockchain","speakers":["Xu Jizhe 徐继哲"],"begin":"2018-08-12T09:50:00+08:00","end":"2018-08-12T10:10:00+08:00","title":"牛顿项目：作为协议经济的基础设施 Newton project: The infrastructure for a protocol-based economy ","intro":"1. why newton 作为协议经济的基础设施，牛顿构建了 “超级交换协议”，包括数字身份和信用、供应链、交易、支付等方面。底层通过 NewChain、NewNet、NewIoT、原子哈希技术等支撑超级交换协议，上层开发者可以基于超级交换协议开发支付、商城、保险等 DAPP 应用。As an infrastructure of protocol-based economy, Newton build \"hyper exchange protocol\", which includes digital identitiy and credit, supply chain, transaction, and payment,etc.. The bottom layer supports the hyper exchange protocol through NewChain, NewNet, NewIoT, and atom hashing technologies, and the upper-level developers can develop DAPP applications such as payment, mall, and insurance based on the hyper exchange protocol.    2. About User privacy 数据来自于用户，所以数据理应是属于我们每一个人的。不过，目前很多互联网平台通过售卖用户数据来赚钱，用户隐私被严重侵害。Newton 区块链技术让这一切成为历史，属于用户的数据产生的收益将还于用户。数据是 21 世纪的石油，用户有权获得数据产生的收益。  The data comes from the user, so the data should belong to each of us. However, at present, many Internet platforms make money by selling user data, and user privacy is seriously violated. Newton's blockchain technology makes it all history, and the revenue generated by the user's data will return to the user.   Data is oil in the 21st century, and users have the right to gain the data.    3. Future of organization development 公司这种组织结构诞生于几百年前的工业革命时期，其主要目的是为了盈利，同时让少部分称为“股东” 的人受益。同时，为了生存和发展、公司不断占领市场，寻求超级利润，实现垄断，才有可能生存和发展。这个时候的公司和外部世界是存在明显的壁垒，公司内部人员难以和公司外部建立和谐的协作关系，而且，传统公司的利润主要来源于对消费者的盘剥，这就会逐渐演变成双方之间零和博弈的对抗性。这样非此消彼长的循环游戏不利于创造和谐共赢的经济发展环境。而传统的组织架构里，这是难以周全的一个问题。区块链技术的产生则有可能为这一问题带来解决方案。未来应该由一个非盈利基金会所管理的社群经济体来取代现在的由盈利公司所管理的封闭平台。This organizational structure of the company was born during the Industrial Revolution hundreds of years ago. Its main purpose was to make profits while benefiting a small number of people who were called \"shareholders.\" At the same time, in order to survive and develop, the company continues to occupy the market, seeks super-profits, and realizes monopolies, it is possible to survive and develop. At this time, there are obvious barriers between the company and the outside world. It is difficult for the company's internal staff to establish a harmonious and cooperative relationship with the outside of the company. Moreover, the profit of the traditional company mainly comes from the exploitation of consumers, which will gradually evolve into a relationship of Zero-sum game and confrontation between the two parties. This non-reversing cycle game is not conducive to creating a harmonious and win-win environment for economic development. In the traditional organizational structure, this is a difficult problem. The emergence of blockchain technology may bring solutions to this problem. The future should be replaced by a community economy managed by a non-profit foundation to replace the current closed platform managed by a profitable company.   4. How for geek  人类社会的科技活动大致可以分为两个阶段，第一阶段是探索真理，比如发展基础理论，第二个阶段是科技应用，是科技真正创造价值、服务于人类的阶段。区块链技术从诞生至今，也是符合这样的规律，2018 年以前所有的区块链项目都有一个共同的特点，本身都是在技术探索阶段，为了发展技术而使用技术。比如 Linux 1.0 之前，他就是 Torvalds 和一群极客的玩具。这个时候它没有任何的用途，他也不能 Power 任何的网站。大家参与是出于兴趣。很多年以前的比特币也是类似这样的一个状态。然而当技术发展到一定程度，其成熟度达到一个拐点，足以和人类的生活融合，这个技术就必须得服务于社会，应用于行业，为我们的生活创造价值，这个技术才有意义。The scientific and technological activities of human society can be roughly divided into two stages. The first stage is to explore the truth, such as the development of basic theory. The second stage is the application of science and technology. It is the stage when science and technology truly create value and serve humanity. Since the birth of blockchain technology, it is also in line with such laws. All blockchain projects before 2018 have a common feature. They are themselves at the stage of technology exploration and use technology to develop technology. For example, before Linux 1.0, it was Torvalds and a group of geek toys. It doesn't have any use at this time, and he can't power any website. Everyone's participation is out of interest.Many years ago Bitcoin was also a similar state. However, when the technology develops to a certain degree, its maturity reaches a turning point and is enough to integrate with human life. This technology must be applied to the society, applied to the industry, and create value for our lives. This technology makes sense. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-blockchain/%2Fcoscup18-blockchain-newton-project)","addition":"","language":"Chinese/English","difficulty":"Skilled / 中階","audience":"Developers of free and open source software"}},"tracks":{"blockchain":{"group":"blockchain","track":"blockchain","communities":["blockchain"],"room":"IB302","title":"Blockchain"}},"speakers":{"Xu Jizhe 徐继哲":{"speaker":"Xu Jizhe 徐继哲","name":"Xu Jizhe 徐继哲","intro":"牛顿基金会创始人、理事长，亦来云联合创始人、2005 年创办自由开源软件社区 “哲思社区”，2011 年加入电商公司好乐买（Okbuy.com）并，任职 CTO，2014 年徐继哲从好乐买离开后，先后创办了包括 3D 打印、智能硬件、手机游戏、人才招聘等创业项目。作为一名自由软件运动的先锋和、倡导者，徐继哲始终致力于推动自由软件在企业中的应用，并长期从事自由软件相关的开发工作。主要关注互联网、网络安全等领域，他在研发基于自由软件研发的网络安全产品、互联网应用产品的同时，始终积极倡导互联网公司应当回馈自由软件社区社团。Jizhe Xu is the Founder and Chairman of the Newton Foundation, and the Co-founder of Elastos. In 2005, he founded the open source software community Zeuux. In 2011, he joined the e-commerce company Okbuy.com worked as CTO. In 2014, he began  establishing his own entrepreneurialship projects such as 3D printing, Intelligent intelligent hardware, mobile game, talent recruitment and so on. As the pioneer and promoter of the free open source software, Jizhe Xu . is committed to developing free software for a long time and promoting the application of free software in Enterprisesenterprises. He mainly focuses on free software-based Internet applications and network security fields. Meanwhile, he actively advocates the enterprises company to feedback to the free software community.","link":"","avatar":"/assets/s00094-1zMv5GfDkbrsbgr4E0VHO-5eYpWDtyyo8.png"}},"communities":{"blockchain":{"community":"blockchain","title":"Blockchain","intro":"我們專注在 Ethereum 技術理論、實作、與應用的討論社群，目前每月由社群參加者自願分享。Ethereum 是具有智能合約功能的區塊鏈平台。","link":"","image":null}}}