{"talks":{"opensuse-leap-flatpak":{"talk":"opensuse-leap-flatpak","track":"opensuse201","speakers":["Kukuh Syafaat"],"begin":"2018-08-12T14:15:00+08:00","end":"2018-08-12T14:30:00+08:00","title":"openSUSE Leap & Flatpak ","intro":"This proposal is a continuation of my previous topic on last summit \"Flatpak & AppImage Usage on openSUSE. Which One Suitable for openSUSE Users?\" (https://events.opensuse.org/conference/summitasia17/program/proposal/1502) that i'm rely on Flatpak on openSUSE Leap since 42.x until 15.0.\n\nUsing Flatpak on openSUSE is such a great way that people can use latest application through Flatpak on stable system with openSUSE Leap. Sometimes, people also can try nightly build apps with Flatpak without dependencies hell or break the system and install the same apps with multiple versions. Flatpak (formerly xdg-app) is a software utility for software deployment, package management, and application virtualization for Linux desktop computers. It provides a sandbox environment in which users can run applications in isolation from the rest of the system. Applications using Flatpak need permission from the user to control hardware devices or access the user's files.\n\nOn this proposal, I will tell my experience that i am encounter in daily use on last two years on using Flatpak with openSUSE Leap. The audience are Linux user, begineer or advanced. Attendees can expect a how Flatpak use on openSUSE Leap in a great way. This proposal will help users to know how to install with software packages without being confused with dependencies. \n\n----\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-opensuse-leap-flatpak)","addition":"","language":"English","difficulty":"Beginner / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Kukuh Syafaat":{"speaker":"Kukuh Syafaat","name":"Kukuh Syafaat","intro":"FOSS Enthusiast","link":"","avatar":"/assets/gnomeasiasummit-1g4cy0zFJhEc19vQDd4OC1hu_DArg7zQd.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}