{"talks":{"sed":{"talk":"sed","track":"opensuse201","speakers":["Michael Chang"],"begin":"2018-08-11T15:30:00+08:00","end":"2018-08-11T15:45:00+08:00","title":"Introduction to Self Encryption Disk (SED) ","intro":"A brief introduction to Self Encryption Disk (SED), a hardware based full disk encryption (FDE), which is implemented by hard disk vendors confining to the OPAL storage specification developed by the Trusted Computing Group (TCG).\n\nThe SED is not rare or expensive, in contrast, it is relatively easy to find on the market of Solid State Drive (SSD) and is also inexpensive. The feature comes with almost no extra cost (money for real), so why not jump on the boat of encrypting your data through most fancy technology. The talk will let you know about how to identify it.\n\nSecond, since it is about Security, the talk will cover the security concerns, and also comparison with Software based encryption on Linux (LUKS).\n\nThird, the majority of the talk is to give you an idea how to set it up in openSUSE, centered around the tool sedutil and will provide you the information of how to use it to accomplish most common tasks (80/20).\n\nLast, it has always been tricky to boot from encrypted device, as we are not only facing trypical chicken-and-egg situation but also different firmware could impose different constraints. We will talk about the solution provided by SED/OPAL spec and also how to use tools in openSUSE to craft that. \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-sed)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Michael Chang":{"speaker":"Michael Chang","name":"Michael Chang","intro":"Software Engineer at SUSE","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}