{"talks":{"software-supply-chain-and-oss":{"talk":"software-supply-chain-and-oss","track":"compliance","speakers":["Satoru Ueda"],"begin":"2018-08-12T10:10:00+08:00","end":"2018-08-12T10:50:00+08:00","title":"Software Supply Chain and OSS ","intro":"Modern software development projects are based on network of software module providers. The software providers will be:\n\n- Software platform (such as Operating System) providers\n- Middleware providers\n- Software development kit providers such as semiconductor vendors\n- Outsourcers of software development\n- ODM/OEM manufacturers\n\nSome of those parties may be Open Source Software (OSS) development communities which will surely provide OSS.  Some of them will also have possibilities to include OSS into their works.  If some of them do not use OSS appropriately what will it become?  In this session, we would like to consider the problem of software supply chain from view point of the appropriate use of OSS with some recommendations to the parties belonging to the supply chain. \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-software-supply-chain-and-oss)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":"Anyone who wants to use FOSS in compliance with license terms."}},"tracks":{"compliance":{"group":"compliance","track":"compliance","communities":["foss"],"room":"IB503","title":"FOSS Compliance - Complex Made Simple\t"}},"speakers":{"Satoru Ueda":{"speaker":"Satoru Ueda","name":"Satoru Ueda","intro":"From early 2003, Satoru Ueda has been engaged in a project to widely use Linux for consumer electronics appliances and IoT devices. In the project he has been supporting to establish and enhance collaborative relationship between the community and the embedded system developers. As from 2012 to 2017, he participates in the Keio university Leading Graduate School program as the Project Professor (in charged for education) and considering the value of open community for the innovation. The challenge to harmonize with community and many Consumer Electronics products related companies is based upon his past experience of product planning and marketing for UNIX workstation and research of ecology of independent film making community.","link":"","avatar":"/assets/s00011-1nQeTIXgiJO8LHYunIyPH4QdQAOfshE2M.png"}},"communities":{"foss":{"community":"foss","title":"FOSS Compliance - Complex Made Simple","intro":"Many organization and companies make use of Free and Open Source Software (FOSS) without following the license terms. In many cases, these orgnization and companies just don't know how to do it in practice. Therefore, in this track the related concerns and issues will be discussed, and the pratical steps and examples will be provided. This track will introduce the practical steps and core components how to comply with FOSS licenses.","link":"","image":null}}}