{"talks":{"source-code-navigation-assistant":{"talk":"source-code-navigation-assistant","track":"misc101","speakers":["c9s"],"begin":"2018-08-12T16:15:00+08:00","end":"2018-08-12T16:45:00+08:00","title":"Source Code Navigation Assistant ","intro":"Nowadays, the screen readers are used for the blind people to read the text on the screen. The speech speed of the screen reader is usually incredibly fast, and it reads almost everything on the screen.  Also, the generated speech is not so friendly for the users.\n\nHowever, it's important for people to quickly get the meaningful summary of the current source code navigation, even for people with average eye-sight.\n\nThis talk introduces you the design of the navigation assistant, and the technical implementation details of the tool.\n\nThe assistant is implemented in Go, and its language parser is used to generate a short comprehensive summary, and the text will be converted to voice speech to improve your source code navigation experience. ","addition":"","language":"漢語 / Mandarin Chinese","difficulty":""}},"tracks":{"misc101":{"group":"misc","track":"misc101","communities":["coscup"],"room":"IB101","title":"綜合"}},"speakers":{"c9s":{"speaker":"c9s","name":"Yo-An Lin (c9s)","intro":"從 2007 年開始投入開放原始碼社群及專案已有十年，專精領域從 UI/UX Design, Visual Design, 前端如 TypeScript, JavaScript, CSS/SASS 等至後端技術如 Perl, Golang, PHP, NodeJs 等等。\n於 2011 年開始使用 Go 程式語言開發工具 ，並於 2012 年將 Go 程式語言應用於正式環境 (Production) ，發布十多個 Go 相關開源專案，為 Golang 核心專案貢獻者之一。\n曾在 Perl 最大的開放原始碼模組平台 CPAN 維護近五十個模組，至今在 GitHub 上開源約兩百多個專案。\n知名專案為 PHPBrew, Maghead (ORM), Pux, CLIFramework 以及如 C 語言開發的高效能路由函式庫 r3。\n其他曾參與貢獻的知名開源專案有 Google Go / HHVM / PHP (Zend Engine) / Jifty Perl Web Framework 等等。\n曾為 2013 年 GitHub top 1 contributions user.","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"coscup":{"community":"coscup","title":"COSCUP","intro":"COSCUP 是由台灣開放原始碼社群聯合推動的年度研討會，起源於 2006 年，是台灣自由軟體運動 (FOSSM) 重要的推動者之一。\n活動包括有講座、攤位、社團同樂會等，除了邀請國際的重量級演講者之外，台灣本土的自由軟體推動者也經常在此發表演說，會議的發起人、工作人員與講者都是志願參與的志工。\nCOSCUP 的宗旨在於提供一個聯結開放原始碼開發者、使用者與推廣者的平台。希望藉由每年一度的研討會，來推動自由及開放原始碼軟體 (FLOSS)。","link":"https://coscup.org","image":null}}}