{"talks":{"the-dexon-network":{"talk":"the-dexon-network","track":"misc101","speakers":["Popo Chen"],"begin":"2018-08-11T16:40:00+08:00","end":"2018-08-11T17:10:00+08:00","title":"The DEXON Network - The Infrastructure of the Internet’s Decentralized Future ","intro":"Current blockchain technology suffers from transaction latency, high transaction cost and centralized limitations. The new generation blockchain technology uses parallel blockchain systems that work together to form an infinitely scalable, low-latency decentralized transaction processing engine. This will resolve the existing pain points today and upgrade blockchain technology to the next level with mass adoption to all. \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-the-dexon-network)","addition":"","language":"漢語 / Mandarin Chinese","difficulty":"Begineer / 入門","audience":"Software Engineers interested in blockchain era"}},"tracks":{"misc101":{"group":"misc","track":"misc101","communities":["coscup"],"room":"IB101","title":"綜合"}},"speakers":{"Popo Chen":{"speaker":"Popo Chen","name":"Popo Chen","intro":"Popo is a 27-year-old serial entrepreneur with several successful exits. He founded 17 Media, a leading live streaming platform across Asia, and cashed-out at a 200M USD valuation in 2 years. He also founded COBINHOOD, the cryptocurrency service platform for the blockchain era which launched the world’s first zero trading fee cryptocurrency exchange, ranking top-30 in terms of global trading volume. With his eyes set on materializing the future-proof infrastructure of the decentralized internet, he also founded DEXON Foundation, an organization which leads the development of the infinitely scalable decentralized technology, the DEXON network.","link":"","avatar":"/assets/s00131-1uAFirk9aXmQJTAe728XVg6J77MyWNI0z.png"}},"communities":{"coscup":{"community":"coscup","title":"COSCUP","intro":"COSCUP 是由台灣開放原始碼社群聯合推動的年度研討會，起源於 2006 年，是台灣自由軟體運動 (FOSSM) 重要的推動者之一。活動包括有講座、攤位、社團同樂會等，除了邀請國際的重量級演講者之外，台灣本土的自由軟體推動者也經常在此發表演說，會議的發起人、工作人員與講者都是志願參與的志工。\n\nCOSCUP 的宗旨在於提供一個聯結開放原始碼開發者、使用者與推廣者的平台。希望藉由每年一度的研討會，來推動自由及開放原始碼軟體 (FLOSS)。","link":"https://coscup.org","image":null}}}