{"talks":{"using-your-domain-name":{"talk":"using-your-domain-name","track":"misc101","speakers":["Thomas Kuiper"],"begin":"2018-08-12T15:40:00+08:00","end":"2018-08-12T16:10:00+08:00","title":"Freedom, thanks to your domain name! ","intro":"Your internet presence starts with a domain name! You can use it for e-mail (SMTP, IMAP, POP3), your website with HTTP(s), your applications (VoIP, XMPP, RTSP, FTP ...). This talk with give a high level overview what you should know about your domain name and why its among your most important digital assets. We will also look into how to protect it properly and use it with a team of developers. \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-using-your-domain-name)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":"Everyone"}},"tracks":{"misc101":{"group":"misc","track":"misc101","communities":["coscup"],"room":"IB101","title":"綜合"}},"speakers":{"Thomas Kuiper":{"speaker":"Thomas Kuiper","name":"Thomas Kuiper","intro":"Thomas Kuiper is the General Manager of the Asia subsidiary of domain name registrar Gandi and originally from Germany. He worked on embedded systems and content management systems for companies in Taiwan and Europe before he set himself to the task to start Gandi's Asia business unit. Gandi (abbreviation for\"Gestion et Attribution des Noms de Domaine sur Internet\"in French or\"Management and Allocation of Domain Names on the Internet\" in English) is a company that provides domain name registration and management in addition to Internet hosting infrastructure and related services.\n\nThe company has its head office in Paris and offices in San Francisco, Luxembourg and Taipei to serve its customers around the clock. Gandi was among the first European domain name registrars to offer \".COM\" and \".NET\" and now manages over 2 million domain names with accreditation for over 700 different domain name extensions for its customers, placing Gandi among the top domain name registrars worldwide.","link":"","avatar":"/assets/s00005-1Q9XAVpeYau9-3lUuKgF-fWSErqAdL3Xw.png"}},"communities":{"coscup":{"community":"coscup","title":"COSCUP","intro":"COSCUP 是由台灣開放原始碼社群聯合推動的年度研討會，起源於 2006 年，是台灣自由軟體運動 (FOSSM) 重要的推動者之一。活動包括有講座、攤位、社團同樂會等，除了邀請國際的重量級演講者之外，台灣本土的自由軟體推動者也經常在此發表演說，會議的發起人、工作人員與講者都是志願參與的志工。\n\nCOSCUP 的宗旨在於提供一個聯結開放原始碼開發者、使用者與推廣者的平台。希望藉由每年一度的研討會，來推動自由及開放原始碼軟體 (FLOSS)。","link":"https://coscup.org","image":null}}}