{"talks":{"using-latest-libreoffice":{"talk":"using-latest-libreoffice","track":"opensuse304","speakers":["小笠原 徳彦 Naruhiko Ogasawara"],"begin":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","title":"Using latest LibreOffice on openSUSE Leap 15 ","intro":"LibreOffice is a feature-rich, open-sourced office productive suite and is one of the critical parts of Linux desktop like openSUSE.\n\nConsumer products, like LibreOffice, have to keep continuous evolve to catch end-users' desire than server-side software which is preferred to be more stable than features added. Thus, LibreOffice takes time-based release policy of performing major release with functional additions every six months.\n\nSometimes you may want to use newer LibreOffice (includes daily build or beta/RC testing build) than pre-packaged version shipped with openSUSE Leap 15 (Leap 15 provides latest \"Fresh\" LibreOffice 6.0 at the moment (June), but 6.1 will be released August). Of course, you can use TDF build RPM package instead of openSUSE package, but you can do this quickly with modern packaging systems, like Flatpak, AppImage or Snap. Additionally, you can also use several versions parallelly with them.\n\nIn this talk, I would like to introduce these ways and pros/cons of the packaging systems on openSUSE Leap 15. ","addition":"","language":"English","difficulty":"Begineer / 入門"}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"小笠原 徳彦 Naruhiko Ogasawara":{"speaker":"小笠原 徳彦 Naruhiko Ogasawara","name":"小笠原 徳彦 Naruhiko Ogasawara","intro":"Naruhiko Ogasawara is a member of the LibreOffice Japanese team, and also a member of The Document Foundation; the charitable foundation which is home of LibreOffice. Mainly my responsibilities are organizing UI translations, outreaching LibreOffice in Japan, e.g. exhibit Japanese local FLOSS events, etc. And several years ago I had been a translator of openSUSE Weekly News. Sorry I'm not a user of openSUSE, but I use Ubuntu as a usual desktop environment. I love FLOSS desktop technologies.","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":null}}}