{"talks":{"we-are-opensuse-asia-summit":{"talk":"we-are-opensuse-asia-summit","track":"opensuse201","speakers":["Sunny"],"begin":"2018-08-12T10:45:00+08:00","end":"2018-08-12T11:00:00+08:00","title":"We are openSUSE.Asia Summit ","intro":"openSUSE.Asia Summit 2018 is the 5th Asia summit, when I looked back the way we took to get here, there were lots of impressive memories. I would take this oppertunity to open Photo album of openSUSE.Asia Summit and share with you all about our stories. Might you are in our stories, and might you will be in our stories. \n\nI will also introduce our process of call for host, call for logo design, call for paper and call for volunteer, so that people can better know how do they get involve in. This is no possible to make openSUSE.Asia summit happen by just one people, so with you, we are openSUSE.Asia summit. ","addition":"","language":"English / Chinese","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Sunny":{"speaker":"Sunny","name":"Sunny","intro":"I'm Sunny, and I come from China. I joined SUSE from 2008 which was a\nstart for me to much more get involved in open source community. I was\none of members of hosting the first openSUSE.Asia Summit. We expected to\nspread open Source in Asia through this event and provide more\noppertunities for Asia contributors to have a f2f community during the\nsummit. I'm openSUSE member and working on promoting open Source and\nencouraging more women get involve in open Source projects specially.","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE 亞洲高峰會是 openSUSE 社群 (即: 貢獻者跟使用者) 很重要的活動之一，那些平常都在線上交流的人，現在可以一起面對面，與來自世界各地的高手進行交流，社群成員將會分享他們最新的知識、經驗，並學習關於 openSUSE FLOSS 的技術。\n\n這次在台北的活動是 openSUSE 亞洲高峰會的第五次，繼 2014 年首次的亞洲高峰會是在北京之後，過去的亞洲高峰有來自中國、台灣、印度、印度尼西亞、日本、南韓等國的參加。","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}