{"levels":{"Titanium":{"title":"Titanium Sponsor"},"Co-Host":{"title":"Co-Host Sponsor"},"diamond":{"title":"Diamond Sponsor"},"gold":{"title":"Gold Sponsor"},"silver":{"title":"Silver Sponsor"},"bronze":{"title":"Bronze Sponsor"},"co-host":{"title":"Co-host"},"media":{"title":"Media Partners"},"special-thanks":{"title":"Special Thanks"}},"sponsors":[{"level":"Titanium","name":"Gandi","intro":"Gandi is a domain name registrar and cloud hosting provider. We now manage nearly 2 million domain names (which puts us among the top registrars in the world) and offer over 700 extensions (such as .cafe, .taipei, .tw, .club, .asia). Gandi supports numerous open source projects (Gnome, Debian, Ubuntu, Let's Encrypt). We would be happy to support your open source project with our resources, just contact us.\n\nWhat you get with each domain name at Gandi\n* A 1-year SSL certificate\n* 5 mailboxes with a total of 1 GB storage\n* 1000 forwarding addresses\n* Private Domain name registration\n* Reduced pricing (50% off) for Gandi's Simple Hosting (for Wordpress, Drupal, Django and others).\n\nVisit us: www.gandi.net\n\nGandi's open source tools\n\nGandi CLI, to manage domain names, SSL, hosting from the command line: http://cli.gandi.net/ Let's Encrypt for Gandi CLI: https://github.com/Gandi/letsencrypt-gandi\nBaobab, the application behind status.gandi.net: https://github.com/Gandi/baobab","image":"gandi.png","link":"https://www.gandi.net/zh-hant"},{"level":"gold","name":"Skymizer","intro":"Skymizer is proficient in compiling and virtualization, which helps customers building efficient virtual machine for blockchain and compilers for hardware accelerators of deep learning. Our product “Skymizer C/C++ Intelligent Compiler” is powered by artificial intelligence and compiler techniques which improves both the efficiency and the quality of software automatically. It makes software engineers work smarter and easier.","image":"Skymizer.png","link":"https://skymizer.com/"},{"level":"gold","name":"Appier","intro":"Appier is a technology company which aims to provide artificial intelligence platforms to help enterprises solve their most challenging business problems. Appier was established in 2012 by a passionate team of computer scientists and engineers with expertise in AI, data analysis, distributed systems, and marketing. Appier serves over 1,000 global brands and agencies from offices in 14 markets across Asia, including Taipei, Singapore, Kuala Lumpur, Tokyo, Osaka, Sydney, Ho Chi Minh City, Manila, Hong Kong, Mumbai, New Delhi, Jakarta, Seoul, and Bangkok. ","image":"Appier.png","link":"http://www.appier.com/zh/"},{"level":"silver","name":"","intro":"Gamesofa was founded in 2005. The company&#39;s pioneering use of the best emerging\nweb technologies allowed Gamesofa to expand on the gaming market, having since\ndeveloped 20 franchises across multiple platforms including web, Android, and iOS,\nall of which have cemented Gamesofa’s reputation as one of Taiwan’s leading game\ndevelopment companies.\nGamesofa’s motto, “Fun in Five Minutes” reflects the company’s core philosophy of\nproviding a fun yet casual multiplayer experience. With the creation of “Godgame\nMahjong,” Gamesofa successfully brought Taiwan its very first web Mahjong game.\nGamesofa followed up their success with the world’s first browser-based 3D shooter,\n“Guns Rush.” More recently Gamesofa has gone international, breaking into markets\nin Indonesia, Thailand, and Vietnam with localized Texas Hold’em applications, in\nIndia with “Bollywood Teen Patti,” and in Russia with their 3D tank warfare game,\n“Tank Hit.” Overall, Gamesofa boasts a user base of 50 million registered players\nworldwide and over 2 million daily active users.","image":"gamesofa.png","link":"https://www.gamesofa.com/"},{"level":"bronze","name":"UniSharp","intro":"Unisharp is an open and passionate team proficient in website and API development.\r\nWe are big fans of FOSS and highly active on github. Making pull requests is our daily routine to contribute to open source. We’ve also developed various useful packages for PHP (Laravel) and NodeJS.\r\nCome join us to support COSCUP 2017!","image":"unisharp.png","link":"https://www.unisharp.com/"},{"level":"bronze","name":"Skymirror","intro":"","image":"skymirror.png","link":"https://www.skymirror.com.tw/"},{"level":"bronze","name":"","intro":"","image":"","link":""}]}