{"talks":{"application-synthesizer":{"talk":"application-synthesizer","track":"oss","speakers":["Ming Jiang"],"begin":"2018-08-12T14:15:00+08:00","end":"2018-08-12T15:00:00+08:00","title":"Application Synthesizer ","intro":"The application synthesizer allows the testers to define and automatically deploy synthesized applications, components, and their features according to a form of high-level specification. The specification could define the number of VMs deployed, each VM’s resources (such as memory, CPU, disk, and networking parameters), the type of applications in a VM (such as load balancer, web server or database server), VM’s communications mechanisms (such as socket or queues), anomaly event triggers by VM (such as rebooting an application and up/down interfaces according to timer), etc. With such a powerful application synthesizer, the testers possess the capability to reliably test Application Performance Management in a controlled and scalable cloud environment. ","addition":"* Language: English\n* Audience: DevOps engineer\n* Difficulty: Skilled / 中階"}},"tracks":{"oss":{"group":"oss","track":"oss","communities":["ossoftware"],"room":"IB401"}},"speakers":{"Ming Jiang":{"speaker":"Ming Jiang","name":"Ming Jiang","intro":"Dr. Ming Jiang received his BS and MS degrees in electrical engineering from National Taiwan University and PhD degree in electrical engineering and computer science from University of Illinois at Chicago. He has been with several academic institutes (University of Alaska Fairbanks, National Taiwan University, Chung Cheng University) and industrial leading companies in high-performance/supercomputing, cloud computing, telecommunications, networking and Internet security (ARSC supercomputer center, 3COM, Tellabs, Symantec, Ericsson) for more than 25 years combined. His research interests and specialty are cloud computing and Internet security, especially in the areas of virtualization, Software-Defined Data Center, and SDN enabled networks. He is currently with ITRI as a Technical Director.","link":"","avatar":null}},"communities":{"ossoftware":{"community":"ossoftware","link":"","image":null}}}