{"talks":{"deployment-of-multi-node-web-server":{"talk":"deployment-of-multi-node-web-server","track":"opensuse304","speakers":["Didiet Agus Pambudiono"],"begin":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:30:00+08:00","title":"Deployment of multi node web server, database server and storage session server with Ansible ","intro":"In deploying the server, especially in large quantities, it takes a long time, because the deployment must be done on each server one by one, deployment must also be done in detail so that each server is identical to each other in a group. \nIf this is done then there is the possibility of one or more of the servers not being identical to the other servers in a group. \nSo we need a tool to simplify the work, and then we use Ansible to do more deployment in the future. What is Ansible? Ansible is an open-source IT automation engine which can remove drudgery from your work life, and will also dramatically improve the scalability, consistency, and reliability of your IT environment. \nWe use ansible to deploy web servers, database servers with galera clusters, and session storage servers with master-slave mode. With the use of this tool can reduce the time required in deployment servers, and unidentical server in a group can be avoided \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-deployment-of-multi-node-web-server)","addition":"","language":"English","difficulty":"Skilled / 中階","audience":""}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304"}},"speakers":{"Didiet Agus Pambudiono":{"speaker":"Didiet Agus Pambudiono","name":"Didiet Agus Pambudiono","intro":"openSUSE user, member of openSUSE Indonesia, and Kelompok Linux Arek Suroboyo","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}