{"talks":{"drbd":{"talk":"drbd","track":"opensuse201","speakers":["Syuta Hashimoto"],"begin":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:30:00+08:00","title":"DRBD - block device replication solution for HA cluster mainly ","intro":"This talk explains HA cluster used by DRBD. \nDRBD is block device replication software developed by LINBIT and licensed by GPLv3. \nHA cluster is usually an expensive fee for device and controller software. \nDRBD can make HA cluster low cost because it is opensource and can use general devices.\n\nVolumes can become the single point of failure. but DRBD can cover it. \nand we can use it by manage controllers like drbdmanage or LINSTOR. \nLINSTOR has not been yet supported in openSUSE. but, LINBIT quitted development of drbdmanage. and announced developing LINSTOR. \nso I explain LINSTOR to provision HA cluster. I wish openSUSE will support LINSTOR. and I think basic philosophy is same.\n\nHA cluster used by DRBD is more usable. DRBD can use with pacemaker and Corosync, with kubernetes. and more. this talk introduces them. \npacemaker and Corosync can manage clusters. pacemaker and Corosync change active node when detecting a failure. \nDRBD support kubernetes by Kubernetes Flex Volume plugin.\n\nI remark easy step to setup HA cluster with DRBD. so attendee can learn how to setup HA cluster with easy way and HA cluster background philosophy. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-drbd)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201"}},"speakers":{"Syuta Hashimoto":{"speaker":"Syuta Hashimoto","name":"Syuta Hashimoto","intro":"openSUSE-ja member. I was a local committee for openSUSE.Asia Summit 2017(Tokyo, Japan), And I am a global committee for openSUSE.Asia Summit 2018.","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}