{"talks":{"machine-economy-with-iota":{"talk":"machine-economy-with-iota","track":"misc101","speakers":["Edward Greve"],"begin":"2018-08-11T13:30:00+08:00","end":"2018-08-11T14:20:00+08:00","title":"Machine Economy with IOTA ","intro":"In this group, we invite individuals with an interest in Blockchain and Distributed Ledger Technology to investigate and collaborate on projects using the IOTA Tangle platform (think blockchain 3.0 minus block and chain).\n\nAll are welcome to this group, we are about collaboration and exploration.\n\nIf you'd like more information about the IOTA Tangle platform please see the links below, (there are some clear video explanations).\n\nWhy we think the IOTA Tangle has the potential to be bigger than Blockchain\n\n* No transaction fees - enabling microtransactions\n* Decentralized - no miners\n* More network use = a faster network\n* Infinitely Scalable\n* An ecosystem for the Machine Economy\n* IOTA protocol ensures data integrity in information sharing\n* Tangle technology uses ternary code, a natural progression from binary code.\n* Quantum secure - resistant to quantum computer cryptanalysis. \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-misc/%2Fcoscup18-misc101-machine-economy-with-iota)","addition":"More info:\n\n* IOTA to be adopted by National Banks (https://coin.fyi/news/iota/iota-in-talks-with-national-banks-74tofo)\n* IOTA Challenging the Status Quo (https://youtu.be/LyC04NrJ3yA)\n* IOTA BREAKDOWN: The Tangle Vs. Blockchain Explained (https://youtu.be/I_jNH9BlEEo)\n* IOTA Co-Founder Dominik Schiener on IOTA & The Tangle | Revolutionizing Blockchain Technology (https://youtu.be/qsvCArWs_MI)\n* IOTA Co-Founder David Sønstebø, IOTA Interview (https://youtu.be/T2FJ9hH66b8)\n* Me! reading out a David Sonstebo interview (https://youtu.be/4D48brXuH9Q)\n* IOTA tutorial 1: What is IOTA and some terminology explained (https://youtu.be/MsaPA3U4ung)\n* IOTA tutorial 2: Trit and Tryte (https://youtu.be/2pBZJvVn4NY)\n* IOTA tutorial 3: IOTA Seed (https://youtu.be/UClPU2e2MJI)\n* IOTA Data Market Place Webinar (https://youtu.be/fqdZSafCRhM)\n\nOfficial IOTA sites:\n\n* IOTA Website (http://www.iota.org/)\n* IOTA Index (http://www.iotaindex.com/)\n* IOTA Blog (https://blog.iota.org/)\n* IOTA Support (https://iotasupport.com/) ","language":"English","difficulty":"Skilled / 中階","audience":"Blockchain/DLT developer, IoT engineers"}},"tracks":{"misc101":{"group":"misc","track":"misc101","communities":["coscup"],"room":"IB101"}},"speakers":{"Edward Greve":{"speaker":"Edward Greve","name":"Edward Greve","intro":"Edward Greve has been a software developer for a number of years, most recently at WillowTree Apps in North Carolina, where he worked on cutting edge digital products for nationally and internationally recognizable brands, such as CBC and National Geographic. His area of expertise is in full-stack web development, and he understands how to work with business partners to develop advanced cloud-based systems that support applications with a world-class user experience. Edward holds degrees in Mathematics and Physics from Rowan University and is fully self-taught in computer science. He is also a language enthusiast and polyglot, and he speaks fluent Mandarin Chinese, Dutch, and French in addition to conversational bits and pieces in a half-dozen other languages from around the world. He spent almost a decade living and working in Taiwan. Edward Greve has a wide range of experience from different regions and brings with him a varied skill set to the IOTA Foundation, and while his primary role will be full stack front-end development, he plays a key role in supporting the IOTA Foundation’s efforts on the ground in Asia to establish IOTA as a standard in the region for IoT and beyond. His polyglot abilities is also a very useful asset for obvious reasons.","link":"","avatar":"/assets/s00038-1LbTgL5Wo2VZt_-CfSyu1MAwGJ1SBjGNy.png"}},"communities":{"coscup":{"community":"coscup","link":"https://coscup.org","image":null}}}