{"talks":{"open-source-licensing-makes-a-difference":{"talk":"open-source-licensing-makes-a-difference","track":"compliance","speakers":["Florence T.M. Ko 葛冬梅"],"begin":"2018-08-12T09:35:00+08:00","end":"2018-08-12T10:10:00+08:00","title":"Open Source Licensing makes a Difference / 開源授權就是不一樣 ","intro":"From its rise to becoming an indispensable part of many industries nowadays, Open Source Software (OSS) has only been developed for about 30 years. How come OSS can be developed so rapidely and spread so widely in this short time. Its licensing model, which is different from the past common software licensing model, plays an important role. This kind of licensing model allows users to copy, modify and distribute software directly, without asking the owner of a software for permission additionally. OSS can hence easily be modified and implemented in different industries. Speaker will accordingly introduce the characteristics of OSS licensing model and the related actual articles in OSS licenses. Besides, the commonly used OSS licenses and the differences between these licenses will also be talked about. This talk serves as the introduction of this track and will be held in Chinese so that the majority of audience can better understand the content of the talk and the following sessions.  / 開源軟體從崛起、受到矚目，再到目前許多產業已經不能沒有它的狀況，僅短短發展二、三十年，為什麼開源軟體的發展可以這麼快速？其中一個重要的原因就是它擁有不同於以往的授權模式。開源授權模式允許使用者可以直接重製、修改與散布軟體，而不需要再額外徵詢軟體所有權人的同意，開源軟體因此很容易被改進以及被運用到不同的地方。本場次因此將會介紹開源授權的特性，白話地說明其在授權條款上是如何被實際規定出來，同時也會簡介常見的開源授權條款，以及這些條款間的重大差異。本場次是這個議程軌的基礎導論，用以協助會眾了解接下來的議程內容，所以本場次會以中文進行。 ","addition":"* Language: 漢語 / Mandarin Chinese\n* Audience: 任何想要了解開源授權，或者想要以符合授權條款規定來利用開源軟體的人。 / Anyone who wants to understand OSS licensing or to use OSS in compliance with license terms.\n* Difficulty: Begineer / 入門"}},"tracks":{"compliance":{"group":"compliance","track":"compliance","communities":["foss"],"room":"IB503"}},"speakers":{"Florence T.M. Ko 葛冬梅":{"speaker":"Florence T.M. Ko 葛冬梅","name":"Florence T.M. Ko 葛冬梅","intro":"Florence T.M. Ko (葛冬梅) is the co-founder of Taiwan Open Source Legal Nrtwork (OSLN Taiwan) and a freelancer with specilty in Free and Open Source Software Licensing (FOSS Licensing). She often introduces the international resources of FOSS Licensing into Taiwan, and organised many important events related to FOSS Licensing in the past. Besides, she is also highly interested in public licensing, such as Creative Commons and Open Data. During 2005-2015, Florence worked at OpenFoundry in Academia Sinica, Taiwan. For many years, she was the editor and writer of \"Legal Column\" on OSSF newsletter, which is the official publication of OpenFoundry. For more details about Florenc's resume please see: http://tw.linkedin.com/in/florencetmko / 葛冬梅（Florence T.M Ko）目前為自由工作者、台灣開源法律網絡 (Taiwan Open Source Legal Networkp, OSLN Taiwan) 的共同發起人，專長在於解析自由開源授權條款內容。她經常將國際上自由開源授權相關的資源介紹到台灣，也舉辦過多場以自由開源授權為主題的重要活動。而除了開源授權外，她對創用 CC、開放資料等公眾授權模式的議題，也具有高度興趣。葛冬梅在 2005-2015 年間任職於中央研究院自由軟體鑄造場，曾擔任鑄造場電子報上「法律專欄」的編輯與固定撰稿人多年。葛冬梅進一步個人資訊請見： http://tw.linkedin.com/in/florencetmko","link":"","avatar":null}},"communities":{"foss":{"community":"foss","link":"","image":null}}}