{"talks":{"understand-and-perform-the-foss-compliance":{"talk":"understand-and-perform-the-foss-compliance","track":"compliance","speakers":["Lucien C.H. Lin / 林誠夏"],"begin":"2018-08-12T11:00:00+08:00","end":"2018-08-12T11:45:00+08:00","title":"Understand and perform the FOSS compliance in a community-driven way / 採社群思維模式做好開源合規 ","intro":"The ICT administrative departments in Taiwan usually know little about \"community\", most of the managers are treating Free and Open Source Software in a traditional way as in IPR management, thus easily to miss and overlook the important part of the obligations under the FOSS licenses, especially the Copyleft ones such as GNU GPL and LGPL. In this session, the speaker shall try to share the observation and experience in the past 10 years about why the FOSS community spirit is proned to be neglected and how the most doable way is to tackle that in the real world practice. 2 to 5 case studying about misunderstanding of FOSS compliance shall be demonstrated, such as the gray line between Shareware and Free and Open Source Software, then the essential points and right ways to avoid and prevent the compliance issues will be communicated and introduced to the audience. / 在台灣，資通訊產業的管理部門對「社群營造」所知甚少，多數經理人以傳統模式來進行自由開源軟體的智財權管理，因為如此，部份重要的自由開源軟體授權義務性要求常容易被忽略與忽視。於此議程，講者將基於其過去 10 年的觀察與經驗，試著分享為何這些自由開源軟體的社群精神會容易被忽略，並且提出如何為實作上最可行的因應之道。2 至 5 個對自由開源軟體合規常見的實例誤解將會被展示說明，例如共享軟體與自由開源軟體之間的灰色區隔線，藉此來向聽眾傳達與介紹，其後避免及預防這些錯誤發生的重要要件及正確之道。 \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-understand-and-perform-the-foss-compliance)","addition":"","language":"漢語 / Mandarin Chinese","difficulty":"Skilled / 中階","audience":"RD and in-house legal staff of ICT companies / 軟體研發人員及公司內部法務人員"}},"tracks":{"compliance":{"group":"compliance","track":"compliance","communities":["foss"],"room":"IB503"}},"speakers":{"Lucien C.H. Lin / 林誠夏":{"speaker":"Lucien C.H. Lin / 林誠夏","name":"Lucien C.H. Lin / 林誠夏","intro":"Lucien Cheng-hsia Lin（林誠夏）, has been doing the FOSS licenses research and study from 2005 to 2016 when acted as an academic professional in the project “OpenFoundry\"hosted in Academia Sinica, which is a FOSS web-hosting service platform based on Subversion and Request Tracker. He is best known for being the main proposer and drafter of the\"Open Government Data License Taiwan 1.0\"(https://data.gov.tw/license), with an one-way CC BY 4.0 switching mechanism implemented, which can make most of the materials on Taiwan Open Data portal be used under CC BY 4.0 license. Besides that, he has been participating in the Open Source, Open Data, and Creative Commons Licenses interpretation and clarification among the local communities, official agencies, and companies in Taiwan for more than 10 years. And now he is engaging to build the Taiwan Open Source Legal Network in the position of legal adviser both of Open Culture Foundation and Gemly Int'l Intellectual Property Right Office for facilitating FOSS licensing knowledge exchange and FOSS ecosystem establishment in Taiwan. / 林誠夏 (Lucien C.H. Lin)，知識背景為科技法律，05-16 年間任職於中央研究院從事公眾授權模式的研究，近年的研究成果包括：協助歐洲自由軟體基金會，擔任自由開源軟體法律參考書台灣專章的編撰作者、參與國家發展委員會就「政府資料開放授權條款」第一版本的討論與編撰，並應臺灣數位文化中心籌備計畫邀請，協助台中市文化局研擬制定「臺中自由文化授權條款」及「臺中開放文化授權條款」，裨利用於開放文化領域的素材流通。目前於鈞理知識產權事務所，以及開放文化基金會擔任法制顧問，撥付工作之餘的心力營建國內開源授權知識的分享網絡 (Open Source Legal Network, Taiwan)，本年度並同時擔任國發會、文化部，以及陸委會政府資料開放諮詢委員。","link":"","avatar":"/assets/s00026-1iEwAsMH8Qng6aayeUduManpzExd-sTfh.png"}},"communities":{"foss":{"community":"foss","link":"","image":null}}}