{"talks":{"an-introduction-from-our-hosts":{"talk":"an-introduction-from-our-hosts","track":"compliance","speakers":["Lucien C.H. Lin / 林誠夏","Shane Coughlan"],"begin":"2018-08-12T09:30:00+08:00","end":"2018-08-12T09:35:00+08:00","title":"An introduction from our hosts ","intro":"Introduction ","addition":"","language":"English","difficulty":"Begineer / 入門"}},"tracks":{"compliance":{"group":"compliance","track":"compliance","communities":["foss"],"room":"IB503","title":"FOSS Compliance - Complex Made Simple\t"}},"speakers":{"Lucien C.H. Lin / 林誠夏":{"speaker":"Lucien C.H. Lin / 林誠夏","name":"Lucien C.H. Lin / 林誠夏","intro":"Lucien Cheng-hsia Lin（林誠夏）, has been doing the FOSS licenses research and study from 2005 to 2016 when acted as an academic professional in the project “OpenFoundry\"hosted in Academia Sinica, which is a FOSS web-hosting service platform based on Subversion and Request Tracker. He is best known for being the main proposer and drafter of the\"Open Government Data License Taiwan 1.0\"(https://data.gov.tw/license), with an one-way CC BY 4.0 switching mechanism implemented, which can make most of the materials on Taiwan Open Data portal be used under CC BY 4.0 license. Besides that, he has been participating in the Open Source, Open Data, and Creative Commons Licenses interpretation and clarification among the local communities, official agencies, and companies in Taiwan for more than 10 years. And now he is engaging to build the Taiwan Open Source Legal Network in the position of legal adviser both of Open Culture Foundation and Gemly Int'l Intellectual Property Right Office for facilitating FOSS licensing knowledge exchange and FOSS ecosystem establishment in Taiwan. / 林誠夏 (Lucien C.H. Lin)，知識背景為科技法律，05-16 年間任職於中央研究院從事公眾授權模式的研究，近年的研究成果包括：協助歐洲自由軟體基金會，擔任自由開源軟體法律參考書台灣專章的編撰作者、參與國家發展委員會就「政府資料開放授權條款」第一版本的討論與編撰，並應臺灣數位文化中心籌備計畫邀請，協助台中市文化局研擬制定「臺中自由文化授權條款」及「臺中開放文化授權條款」，裨利用於開放文化領域的素材流通。目前於鈞理知識產權事務所，以及開放文化基金會擔任法制顧問，撥付工作之餘的心力營建國內開源授權知識的分享網絡 (Open Source Legal Network, Taiwan)，本年度並同時擔任國發會、文化部，以及陸委會政府資料開放諮詢委員。","link":"","avatar":"/assets/s00026-1iEwAsMH8Qng6aayeUduManpzExd-sTfh.png"},"Shane Coughlan":{"speaker":"Shane Coughlan","name":"Shane Coughlan","intro":"Shane Coughlan is an expert in communication, security and business development. His professional accomplishments include spearheading the licensing team that elevated Open Invention Network into the largest patent non-aggression community in history, establishing the leading professional network of Open Source legal experts and aligning stakeholders to launch both the first law journal and the first law book dedicated to Open Source. He currently leads the OpenChain community as Project Director.\n\nShane has extensive knowledge of Open Source governance, internal process development, supply chain management and community building. His experience includes engagement with the enterprise, embedded, mobile and automotive industries.","link":"","avatar":"/assets/s00010-12oj4WEmCUG7n6xaq6ck9H2h4MBX9Pf7I.png"}},"communities":{"foss":{"community":"foss","title":"FOSS Compliance - Complex Made Simple","intro":"Many organization and companies make use of Free and Open Source Software (FOSS) without following the license terms. In many cases, these orgnization and companies just don't know how to do it in practice. Therefore, in this track the related concerns and issues will be discussed, and the pratical steps and examples will be provided. This track will introduce the practical steps and core components how to comply with FOSS licenses.","link":"","image":null}}}