{"talks":{"blockchain-panel-discussion":{"talk":"blockchain-panel-discussion","track":"blockchain","speakers":["Martin Bähr"],"begin":"2018-08-12T12:00:00+0800","end":"2018-08-12T12:25:00+0800","title":"Panel Discussion ","intro":"the general topic that i would like to discuss is FOSS and blockchain.\n\nHow does blockchain fit into the FOSS community?\n\nunlike many other projects that are started in the FOSS community, or where the ideals of the project are very much aligned with the FOSS community, many blockchain projects appear to be following a different philosophy, and the fact that the blockchain code is under a Free Software and Open Source licence is more incidental than intentional.\n\ni will invite a selection of speakers coming to COSCUP to join the panel\nand i'd like to ask every speaker questions like:\n\nwhat is your relationship to the FOSS community?\n\nwhat made you decide to come here, instead of going to a blockchain conference?\n\nhow do you use Free Software and Open Source in your project?\ndo you think that blockchain projects should be more focused on FOSS, on their roots, where their code comes from? if yes, how could we achieve that?\n\ndoes blockchain depend on Free Software and Open Source licensing?\n\nif you had to choose between FOSS and blockchain, what is more important to you?\n\nthe specific set of questions will still change. and i will include the invited speakers in choosing good questions. ","addition":"* Language: English\n* Audience: everyone\n* Difficulty: Begineer / 入門"}},"tracks":{"blockchain":{"group":"blockchain","track":"blockchain","communities":["blockchain"],"room":"IB302","title":"Blockchain"}},"speakers":{"Martin Bähr":{"speaker":"Martin Bähr","name":"Martin Bähr","intro":"Martin has been using Free Software for more than 20 years. He has lived and was active in the local Free Software community on four continents.                                                                                                                           \n\nHe eventually settled in China where he now lives with his family, running a small Web Development Shop. He continues to be active in the Free Software community. He was running the Beijing GNU/Linux User Group for four years and now mentors his successors and he founded the Free Software Community Leadership Roundtable, a forum where community leaders can share and support each other. \n\nIn 2018 he started an initiative to bring together a FOSS oriented blockchain community.\n\nHe has been hosting blockchain meetups and sicusssions at several major FOSS conferences this year.\n\nThrough his career, his interest has always been Free Software that facilitates communication and collaboration and brings the world closer together. He believes that blockchain has a lot to offer to FOSS and wants to further FOSS ideals among blockchain projects.","link":"","avatar":"/assets/martin-2017m - Po-chiang Chao-1_4OIj3-GIqLBB1m0vWcuNeezb4WxxTtz.png"}},"communities":{}}