{"talks":{"build-your-cloud-file-hosting":{"talk":"build-your-cloud-file-hosting","track":"opensuse304","speakers":["Mohammad Rifki Affandi Z"],"begin":"2018-08-12T10:45:00+08:00","end":"2018-08-12T11:00:00+08:00","title":"Build your cloud file hosting using nextcloud on openSUSE Leap 15.0 ","intro":"Nextcloud is a suite of client-server software for creating and using file hosting services. It is functionally similar to Dropbox, although Nextcloud is free and open-source, allowing anyone to install and operate it on a private server. \nIn contrast to proprietary services like Dropbox, the open architecture allows adding functionality to the server in form of applications and enables users to have full control of their data. \nThe original ownCloud developer Frank Karlitschek forked ownCloud and created Nextcloud, which continues to be actively developed by Karlitschek and other members of the original ownCloud team.\n\nin the case of this time, I use openSUSE Leap 15.0 to build nextcloud on it, and I will explain briefly how I can build it and installing nextcloud steps above openSUSE Leap 15.0, which turns out to build nextcloud on your own computer is not too difficult, easy even for beginners though.\n\nso we can build their own cloud file hosting, and that too is free to obtain and is an open source \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-build-your-cloud-file-hosting)","addition":"","language":"English and Indonesia","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"Mohammad Rifki Affandi Z":{"speaker":"Mohammad Rifki Affandi Z","name":"Mohammad Rifki Affandi Z","intro":"I am a college student in Sebelas Maret University and openSUSE user since 2016","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}