{"talks":{"from-openchain-to-fossology---compliance-in-2018":{"talk":"from-openchain-to-fossology---compliance-in-2018","track":"compliance","speakers":["Shane Coughlan"],"begin":"2018-08-12T11:45:00+08:00","end":"2018-08-12T12:15:00+08:00","title":"From OpenChain to FOSSology - Compliance in 2018 ","intro":"A shared understanding of process and rules is key to the success of open source success. Our global community represents many perspectives, many cultures and many jurisdictions. Approaches and tools have appeared to support a balance between flexibility and accuracy. This talk will explain practical open source compliance solutions for real world challenges. It will highlight a \"stack\" of compliance projects (OpenChain, SPDX, Reuse.Software, FOSSology, ScanCode, sw360) and explain how they work from high level (e.g OpenChain) to tooling (e.g FOSSology). \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-compliance/%2Fcoscup18-compliance-from-openchain-to-fossology---compliance-in-2018)","addition":"","language":"English","difficulty":"Skilled / 中階","audience":"Project contributors working in businesses"}},"tracks":{"compliance":{"group":"compliance","track":"compliance","communities":["foss"],"room":"IB503","title":"FOSS Compliance - Complex Made Simple\t"}},"speakers":{"Shane Coughlan":{"speaker":"Shane Coughlan","name":"Shane Coughlan","intro":"Shane Coughlan is an expert in communication, security and business development. His professional accomplishments include spearheading the licensing team that elevated Open Invention Network into the largest patent non-aggression community in history, establishing the leading professional network of Open Source legal experts and aligning stakeholders to launch both the first law journal and the first law book dedicated to Open Source. He currently leads the OpenChain community as Project Director.\n\nShane has extensive knowledge of Open Source governance, internal process development, supply chain management and community building. His experience includes engagement with the enterprise, embedded, mobile and automotive industries.","link":"","avatar":"/assets/s00010-12oj4WEmCUG7n6xaq6ck9H2h4MBX9Pf7I.png"}},"communities":{"foss":{"community":"foss","title":"FOSS Compliance - Complex Made Simple","intro":"Many organization and companies make use of Free and Open Source Software (FOSS) without following the license terms. In many cases, these orgnization and companies just don't know how to do it in practice. Therefore, in this track the related concerns and issues will be discussed, and the pratical steps and examples will be provided. This track will introduce the practical steps and core components how to comply with FOSS licenses.","link":"","image":null}}}