{"talks":{"good-spirit":{"talk":"good-spirit","track":"opensuse201","speakers":["M. Edwin Zakaria"],"begin":"2018-08-12T11:30:00+08:00","end":"2018-08-12T12:00:00+08:00","title":"Maintaining the Good Spirit ","intro":"openSUSE Indonesia community is a bunch of people who love openSUSE in Indonesia, a tropical archipelagic country. \nSince establish in 2007, we experience up and down era which is normal in loose hierarchical organization ;-) \nPeople come and go, but there always someone who willing to maintain and continue the breath of this community. So we have to maintain the good spirit to keep us alive and fun :-)\n\nIn the earlier year we always do a monthly or bi-monthly offline meeting, at that time the internet connection still not massive like it is right now. It was important to meet in person to maintain the cohesiveness of the community. While it was good, but that offline meeting only effective in certain area mainly in Jakarta metropolitan area. Right now, the communication means using internet connection, like website, facebook and telegram are more effective. \nOff course we still do offline meeting/class but not as many as the earlier year.\n\nAs of May 2018, our facebook group have around 4200 member and around 1100 member are active user. Telegram group member are around 370 as of May 2018. Our web site https://opensuse.id is accessed around 51 hits per day.\n\nThis is about openSUSE community progress in our country and examining it in the last 3 years, we're on the right track. \nI would love to share the experience promoting openSUSE and also want to hear other community experience in other Asian countries. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-good-spirit)","addition":"","language":"English","difficulty":"Beginner / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"M. Edwin Zakaria":{"speaker":"M. Edwin Zakaria","name":"M. Edwin Zakaria","intro":"Work for The Research Corporation of University of\nHawaii (RCUH) / Pacific Disaster Center (PDC) as a\nconsultant for Myanmar Department of Meteorology\nand Hydrology for developing disaster aware system.","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}