{"talks":{"introduction-to-opensuse-portus":{"talk":"introduction-to-opensuse-portus","track":"opensuse201","speakers":["DanielLin (suse)"],"begin":"2018-08-12T14:30:00+08:00","end":"2018-08-12T15:00:00+08:00","title":"Introduction to openSUSE Portus ","intro":"Portus is an open source authorization service and user interface for the next generation Docker Registry.\n\nSecure:\n\nImplements the new authorization scheme defined by the latest version of the Docker registry. It allows for fine grained control over all of your images. You decide which users and teams are allowed to push or pull images. \nMap your company organization inside of Portus, define as many teams as you want and add and remove users from them.\n\nEasily manage users with teams:\n\nTeams have three different types of users to allow full granularity:\n\n* Viewers: can only pull images. \n* Contributors: can push and pull images. \n* Owners: like contrinutors, but can also add and remove users from the team\n\nPortus provides an intuitive overview of the contents of your private registry. It also features a search capability to find images even faster.\n\nSearch: \nUser privileges are constantly taken into account, even when browsing the contents of the repository or when performing searches.\n\nThe Docker Registry on the market is very varied. Do you still have a headache to choose? \nCan try Portus, this is a OpenSource tool, but also provides beautiful UI operation \nThe heart is better to learn immediately \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-introduction-to-opensuse-portus)","addition":"","language":"漢語 / Mandarin Chinese","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"DanielLin (suse)":{"speaker":"DanielLin (suse)","name":"Daniel Lin","intro":"","link":"","avatar":null}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}