{"talks":{"introduction-of-open-build-service":{"talk":"introduction-of-open-build-service","track":"opensuse201","speakers":["AL Cho"],"begin":"2018-08-12T13:30:00+0800","end":"2018-08-12T14:00:00+0800","title":"Introduction of Open Build Service ","intro":"The Open Build Service (OBS) is a generic system to build and distribute binary packages from sources in an automatic, consistent and reproducible way. You can release packages as well as updates, add-ons, appliances and entire distributions for a wide range of operating systems and hardware architectures.\n\nOpen Build Service \nCreate and Distribute Software Packages for all the Major Linux Distribution s with all the Tools to Work Together \nComprehensive \nA generic system to build and distribute packages from sources in an automatic consistent and reproducible way. Release your software for a wide range of operating system and hardware architectures. \nCollaborative \nProvides all the tools to work collaboratively and harness the power of the open source development model. Set fine grained access rights, branch code, send merge requests and review submissions.\n\nOBS is \nFor Users \nFor Packagers \nFor Free Software Projects and Independent Software Vendors\n\nThis Open Build Service (OBS) talk will base on \n1. What can the Open Build Service do? \n2. How to use OBS to create your own rpm/packages \n3. How to co-work with OBS \n4. Use Git and OBS for developers \n5. How can you build containers with OBS? - Introduction of OBS Container Registry. ","addition":"* Language: 漢語 / Mandarin Chinese\n* Difficulty: Begineer / 入門"}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"AL Cho":{"speaker":"AL Cho","name":"AL Cho","intro":"openSUSE Taiwan member, love open sourcea and\nfreedom software","link":"","avatar":null}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"","link":"","image":null}}}