{"talks":{"libpinyin":{"talk":"libpinyin","track":"opensuse201","speakers":["Hillwood Yang"],"begin":"2018-08-12T15:00:00+08:00","end":"2018-08-12T16:00:00+08:00","title":"Integrating Cloud Pinyin in ibus-libpinyin ","intro":"Pinyin input method is the most popular input method in China. There are many kinds of Pinyin input methods on ibus, such as ibus-pinyin, ibus-libpinyin and ibus-sunpinyin. All of them need search words from local table dictionary. \nWhat is ibus? The full name of ibus is Input Bus Introduction. It is the default input method framework in SUSE Linux Enterprise and openSUSE GNOME Desktop. ibus-pinyin and ibus-libpinyin work on ibus. ibus and its input method are very important to Asia users of SUSE Linux Enterprise and openSUSE. \nThe cloud computing is the new feature in some commercial input methods in China. They can search and get words from cloud server. Cloud computing can greatly improve the accuracy of the input method. \nThis project is integrating cloud computing in ibus-pinyin or ibus-libpinyin. Many cloud pinyin input methods have apis can be used, Such as baidupinyin and googlepinyin.And Fcitx have finished this work, but it was just a extension on fcitx (fcitx-cloudpinyin). ","addition":"","language":"漢語 / Mandarin Chinese","difficulty":"Begineer / 入門"}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Hillwood Yang":{"speaker":"Hillwood Yang","name":"Hillwood Yang","intro":"Community contributor of openSUSE project.\nWork for openSUSE M17N project in free time.","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":null}}}