{"talks":{"locust-to-go":{"talk":"locust-to-go","track":"sdn","speakers":["郭學聰 (Heush-Tsung Kuo)"],"begin":"2018-08-11T11:15:00+08:00","end":"2018-08-11T11:40:00+08:00","title":"Locust to Go, Kubernetes to Load ","intro":"Locust is an open source load testing tool written in Python.\nIt let us define user behavior using Python, and swarm your system with millions of simultaneous users.\nFor simulating millions of users, Locust offers slave mode to control foreign executable using ZeroMQ. This feature admit us to implement bots, with any programming language support ZeroMQ.\nWe build our game services using Go language, so we reuse some Go code to implement bots. We run our game services on dockers managed by Google Kubernetes, we try to DDoS our game services using dockers managed by Google Kubernetes, too. Finally we tweaked a reliable game service which is able to handle huge amount of users.\nThis talk will share what is Locust, how to implement Locust slave, and how to do load test using Locust and Google Kubenetes. ","addition":"","language":"漢語 / Mandarin Chinese","difficulty":"Skilled / 中階","audience":"Go programmers and site reliability engineers who want to know how to tweak performance of cloud service."}},"tracks":{"sdn":{"group":"sdn","track":"sdn","communities":["sdn"],"room":"IB401","title":"SDN x Cloud Native"}},"speakers":{"郭學聰 (Heush-Tsung Kuo)":{"speaker":"郭學聰 (Heush-Tsung Kuo)","name":"郭學聰 (Heush-Tsung Kuo)","intro":"* programmer from Rayark, a game company in Taiwan\n* backend engineer\n* usually develop something related to my work in Python, Ruby, Golang, C#\n* built almost entire VOEZ game server by myself only\n* support Sdorica backend development","link":"","avatar":"/assets/s00146-10ITxJ1_fJEoe3WUCSMYmTpdTLm17RtXk.png"}},"communities":{"sdn":{"community":"sdn","title":"SDN x Cloud Native","intro":"由於雲端架構發展趨勢下，網路與雲端應用開發越來越複雜，傳統依賴廠商的解決方案也隨著複雜度的增長，而付出更多開銷，且又受限於廠商軟硬體的綁定，造成未來擴展的彈性問題，因此現今許多網路與雲端架構慢慢傾向以開放式原始碼專案 (Open Source) 來建立自家網路與雲端架構，本議程 SDN x Cloud Native 將邀請多位該領域技術專家來分享如何結合 SDN 與 Cloud Native 來建構虛擬化網路、雲端基礎架構與雲端原生應用開發等。","link":"","image":null}}}