{"talks":{"my-opensuse-journey":{"talk":"my-opensuse-journey","track":"opensuse201","speakers":["Simon Lees"],"begin":"2018-08-12T09:30:00+08:00","end":"2018-08-12T10:00:00+08:00","title":"My openSUSE Journey ","intro":"How someone from the other side of the world ended up on the openSUSE Board.\r\n\r\nIn this talk I will wander through my journey and experiences in the openSUSE project, and how over an 8 year period someone from the other side of the world to most contributors (Adelaide, Australia) ended up on the board of openSUSE.\r\n\r\nThrough this talk i'll cover many parts of the openSUSE project, how they work, how I got involved along with how others can get involved. Covering various areas like providing support through forums, irc and email through to getting involved with development in areas such as packaging and translating, focusing on the concept that anyone can be involved.\r\n\r\nIf the conference organizers would like a keynote from an openSUSE board member, I will be the person who will give the keynote this year and I will use this talk, otherwise i'm happy for to have it as a normal talk. \n\n----\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-my-opensuse-journey)","addition":"","language":"English","difficulty":"Beginner / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Simon Lees":{"speaker":"Simon Lees","name":"Simon Lees","intro":"Simon is a member of the openSUSE board from\r\nAdelaide, Australia. He has been involved in various parts of openSUSE\r\ndevelopment for the last 7 years and currently works for SUSE in one of\r\nthe maintenance / packaging teams. He is also a Release manager for the\r\nEnlightenment desktop.","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}