{"talks":{"next-input-method-framework":{"talk":"next-input-method-framework","track":"opensuse201","speakers":["Fuminobu TAKEYAMA"],"begin":"2018-08-11T10:30:00+08:00","end":"2018-08-11T11:00:00+08:00","title":"What is necessary for the next input method framework ","intro":"Input method framework is a software that has been used to input complex characters (e.g., Chinese characters, Hiragana, Hangul). Strictly speaking, the role of input method framework is bridging desktop applications and input method engines, which translate typed keys into complex characters. During this two decades, several input method frameworks including Kinput2, SCIM, UIM, Gcin, Fcitx, and IBus have been developed.\n\nThe situation surrounding text input method is changing. Firstly, new approaches such as software keyboard for touch screen and speech to text input are available on platforms other than Linux desktop.\n\nAnother change is the integration of input method into desktop application platforms. For example, IBus is now a part of GNOME desktop environment; Not only GNOME, Qt also include IBus support. Furthermore, Flatpack also uses a subset of IBus D-Bus interface for applications in Flatpack sandbox to communicate with an input method running on its host desktop.\n\nSome people might think IBus is the defacto standard input method framework. However, quite many people prefer Fcitx or else due to the design issues of IBus. The latter people might think they are losing their freedom to select input method framework.\n\nNow the speaker thinks that it is time to discuss the variety of input method frameworks is really necessary for the future Linux desktop environment. An input method framework itself does not provide much experience for users because its primary role is usually invisible to users. Thereby, how about bringing the war of input method framework and using our effort to improve input method engine, implementing the new approaches mentioned above, and supporting newer application platforms like Wayland?\n\nIn this talk, we would like to discuss what is necessary for the future input method framework by reviewing the design issues of IBus. The topics will be as the followings:\n\n- Thin and high-level protocol with libraries avoiding code duplication \n- The separation of responsibility between IBus daemon and plugins \n- Importance of opened community\n\nNote that the speaker is neither a developer of IBus nor GNOME. The attendees from GNOME community are welcome to improve this discussion. \n\n----\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-next-input-method-framework)","addition":"","language":"English","difficulty":"Skilled / 中階","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Fuminobu TAKEYAMA":{"speaker":"Fuminobu TAKEYAMA","name":"Fuminobu TAKEYAMA","intro":"A package maintainer of the openSUSE M17N project since 2011. Developing packages\nrelated to input methods (e.g., IBus and Mozc) and Japanese fonts. As a member of\nJapan openSUSE User Group, organizing meetups, having seminars at OSS events, and\npublishing Geeko Magazine. openSUSE.Asia Summit 2017 Committee Chair.","link":"","avatar":"/assets/opensuseasiasummit-1xOJTAdtC7Gf3cjZP3JQfoarTYZnKBalv.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}