{"talks":{"nodejs-mysql-8.0":{"talk":"nodejs-mysql-8.0","track":"database","speakers":["Ivan Ma"],"begin":"2018-08-11T11:30:00+08:00","end":"2018-08-11T12:10:00+08:00","title":"Writing a NodeJS Application with Flexible Schema [JSON and Relational Database] The Power of MySQL 8.0 ","intro":"JSON document usage is widely used in data exchange or storage.  Flexible schema by mixing JSON document and relational data in MySQL database  provides the X-over capability allowing the development of next generation application with the extension to the existing operational data from relational database.    The session shares the insight of using JSON document with Relational Database in MySQL 8.0 by creating a NodeJS Booking Application using expressJS framework.   We will show you the highly interested X-over XDevAPI in using the Collection and JSON document.  Join us to see the Power of MySQL 8.0 in Document Store features! \n\n----\n* [Video on YouTube](https://youtu.be/IEOW9T4jNQQ)\n* [Collaborative notes on HackMD](https://hackmd.io/c/coscup18-database/%2Fcoscup18-database-nodejs-mysql-8.0)","addition":"","language":"漢語 / Mandarin Chinese","difficulty":"Skilled / 中階","audience":"Developers, DBA"}},"tracks":{"database":{"group":"database","track":"database","communities":["osdatabase"],"room":"IB501","title":"Open Source Database"}},"speakers":{"Ivan Ma":{"speaker":"Ivan Ma","name":"Ivan Ma","intro":"\n\nIvan Ma is the MySQL User Group Lead in Hong Kong. He has over 20+ years of experience in enterprise system infrastructure and software technologies. He has certification on MySQL DBA 5.6, MySQL Developer 5.1 and MySQL Cluster 5.1 DBA.\n\nHe Joined MySQL, is currently MySQL Principal Sales Consultant, Asia Pacific with Oracle, responsible for pre-sales consulting, technical education, and product promotions.\n\nPrior to joining MySQL team, he joined Oracle in System Team from Sun Mircosystems acquisition. Prior to Sun Microsystems, he was Principal Solution Architect with Sybase APAC covering APAC regions.\n","link":"","avatar":"/assets/s00033-1Imeg-a041L2b6VObey058KySxwAha7l6.png"}},"communities":{"osdatabase":{"community":"osdatabase","title":"Open Source Database","intro":"This community room is going to invite speakers from open source databases (both RDBMS - refer https://zh.wikipedia.org/wiki/RDBMA and NoSQL databases - refer https://en.wikipedia.org/wiki/NoSQL) researchers/developers/contributors/communities/users, to share their newly developed products/use cases/best practices and insight to the industry trend. We hope some topics could be delivered by organizations that running systems on open source databases and created huge success thus the track and benefits the users and developer in Taiwan.","link":"","image":null}}}