{"talks":{"nusantara-metode-input":{"talk":"nusantara-metode-input","track":"opensuse304","speakers":["Rahman Yusri Aftian"],"begin":"2018-08-11T11:15:00+08:00","end":"2018-08-11T11:30:00+08:00","title":"Nusantara Metode Input at OpenSUSE ","intro":"Aksara Nusantara is a variety of script or writing that is used in the archipelago to specifically write a particular regional language. Although the Arabic alphabet and Latin alphabet are also often used to write regional languages, the term Aksara Nusantara is often associated with the letters of inculturation of Indian culture. Various kinds of writing media and stationery are used to write the script of the archipelago. Writing media for inscriptions include stone, wood, animal horns, gold plates, silver plates, copper temples, and bronze plates; writing made with chiseled stationery. Writing media for manuscripts include palm leaves, nipah leaf, coconut leaf, bamboo blades, bark, local paper, imported paper, and fabrics; writing made with stationery in the form of a knife or a pen and ink. \nAksara Nusantara is a unicode script located on the cluster of islands in Indonesia, Java, sunda, rejang, bugis, balinese which is the legacy of tribal characters in indonesia. \nhere I present how to write with Java input method, bali input methodist, rejang input metode, bugis input methode, batak input mothode at operating system Open Suse. \nUnicode archipelago is a project developed by indonesian developers who are now in suspended animation, for that in this event hopefully can revive the archipelago unicode, so as can be an inheritance and can be used in education. \n\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-nusantara-metode-input)","addition":"","language":"English and Indonesia","difficulty":"","audience":""}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"Rahman Yusri Aftian":{"speaker":"Rahman Yusri Aftian","name":"Rahman Yusri Aftian","intro":"I belong to those who step out of line education, hobbies take me to\nthe field of IT, however I managedto bring BlankOn Linux Release 6-8,\nwhich is Code name Ombilin, Pattimura, Rote. This was my penchantfor\nbringing me to fall into the field of IT, and struggling in their\ndaily lives.","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}