{"talks":{"opensource-for-better-india":{"talk":"opensource-for-better-india","track":"opensuse304","speakers":["Jwngfu Brahma"],"begin":"2018-08-12T14:30:00+08:00","end":"2018-08-12T15:00:00+08:00","title":"Opensource for better India ","intro":"India spent around $7.8 billion in IT Sectors in 2017 and the expenditure is expected to reach $8.5 billion in 2018, this is a huge amount. In a country like India, where people living below the poverty lines is more than 22% of the countries 1.3 billion population, money is a scarce resource.\n\nA great portion of this money could be saved by using open source alternatives to proprietary softwares that do the same work at almost no extra cost, and be used elsewhere for better causes.\n\nGovernment of India has introduced various goals and schemes to develop and bring up the computer literacy to everyone in the country, digital India initiative is one such. OpenForge is an open platform that is aimed at organizing policies aimed at open-source by the Govt. of India.\n\nOn 8th November 2016, the government of India announced the demonetisation of all 500 and 1000 rupee bank notes. The whole nation had to suffer in this duration of the cash shortage. The people to suffer most were the ones who had little to no access and knowledge to digital technologies, elderly, low income and less educated were affected the worst. There were even reported deaths due to this.\n\nOne of the major barriers in introducing technology to these people is the language. India has more than 880 languages and dialects spoken across the nation. English is still poorly understood, and this is a huge challenge. It is not possible for a single organisation to support most of those languages in the translations. This is where opensource community and contributors come in, without help from the localization communities, significant amount of translations for the utility apps for at least the official languages wouldn't be possible.\n\nUnlike other Linux distros, what people like about openSUSE is its stability, a huge repository of softwares and the ease of installing them. If a person can install an app from appstore, one can definitely install softwares on openSUSE. This is one of the major reason why so many of friends and I love openSUSE.\n\nThis is what makes it ideal for the FOSS initiatives for humanity that we have currently started to undertake. \nMoreover, unlike Windows and Mac, developing softwares in Linux is much lighter on the system. Making it is ideal for people with less hardware resources to bring their ideas-to-life.\n\nopenSUSE is one-of-a-kind tool that has the potential to lead our journey to make and achieve something great for the people. Over the past few years openSUSE user group in India hasn't seen much of the growth. This maybe because of the fame of Ubuntu in the country. Much of the people still don't know that there isn't one but many distributions of Linux to choose from. Free and open source softwares are all about the freedom of choice, and without making people know about the choices they have, freedom can't fully be achieved.\n\nVarious initiatives have been taken to by colleges and communities in India, including ours. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse304-opensource-for-better-india)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"Jwngfu Brahma":{"speaker":"Jwngfu Brahma","name":"Jwngfu Brahma","intro":"A Computer Science & Engineering student and a lover of Open Source and everything nice!","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}