{"talks":{"panda-vs-enemies-of-openecology":{"talk":"panda-vs-enemies-of-openecology","track":"blockchain","speakers":["YUAN Xun"],"begin":"2018-08-12T10:10:00+0800","end":"2018-08-12T10:30:00+0800","title":"Panda vs Enemies of OpenEcology ","intro":"Knowing that the software industry, and in particular, the blockchain industry, have been suffering from a period of stagnant development as a result of over-inflated expectations, combined with the lack of assistance of any genuine advancements in technology, Pandachain aims to offer to the public a cure and a palliative, by means of the insistent application of blockchain components toward problems of commerce and logistics, as well as a ground-up redesign of the toolchain to bolster the capabilities of third-party developers toward creating a thriving and futuristic economy of sharing.\n\n     \n\n    In the view of the team of Pandachain, it is regretful to observe that so many projects over the past two years were direly focused upon short-term returns, and some were even met with regulatory objection. ICOs raised large amounts of ostensible investment-money, only to categorically declare the funds as being “revenue,” in an attempt to absolve themselves of any material obligations to deliver a functioning and portable system, much less an efficient system.\n\n     \n\n    On the other hand, we feel that a large portion of commerce taking place within China’s still-growing economy is waiting for a “magnitudinous leap forward” whereby the full advantages of the blockchain in terms of data-integrity and the creation of liquidity may be applied to the material and quotidian needs of individuals, groups, shops, factories, warehouses, and other productive and honest activities. In very truth, these activities form the backbone of the civilized state, and are what computing technologies were (originally, as it was premised) expected to serve.\n\n     \n\n    Pandachain is therefore pleased to offer itself as a benefactive and not malefactive, mellontological and not shortsighted solution representing financial and technological might in service of knowledge. Pandachain is not just another ICO. Specifically, it was not founded upon the axiom of composing a realistic-sounding premise to improve a particular sector of economic activity (such as cloud-computing or data-storage) with minimal reference to the underlying productive realities of the supply-chain. Our project is not one which seeks to forcefully connect, through contrived and largely imaginary strictures, that already-working segment of the economy with a narrow range of blockchain-themed pretensions.\n\n     \n\n    Most such projects are shallow precisely because they are designed to nurture ICOs by propounding the blockchain as a replacement for generic problems which were already solved decades ago by the invention of databases. On the contrary, Pandachain, which is built upon hundreds of collective man-years of experience in customary engineering and commerce, and which possesses solid intellectual property to be exercised upon its domain (patents, artwork, novels, licensing rights to films, …) is unique in not seeking, even less loudly proclaiming, that it will “enmesh the economy in blockchain.”\n\n     \n\n    The Panda is a symbol of honesty and integrity. He is not a graduate of the Charlatan University. Using the blockchain and its mechanisms for building trust, achieving consensus, promoting liquidity, and lowering the barriers of ordinary citizens to commerce and investment, Pandachain seeks, instead, to “enmesh the blockchain in Panda.”\n\n     \n\n    Thus, we are pleased to offer a real-time, responsibly governed, semi-decentralized legion of Panda blockchain-nodes, run upon ordinary users' cellphones and home-computers, as well as in corporations, which are able, owing to the fiduciary power of smart contracts, to incrementally improve trade relations, fruitful exchanges of merchandise, and also domestic and intercontinental understanding.\n\n     \n\n    By allowing large numbers of people to freely invest in Pandachain, and then committing their coins to virtual joint-stock corporations, virtual agents, drones, and such, they will be able to participate in the “economy of circulations,” leading to a large-scale increase in liquidity, and ultimately, to the advent of the “gift economy.” We believe in the power of responsible regulation and compliance with society's norms. To that effect, our blockchain will be optimized for auditability, for transparency, and for the novel concept of\"modular\"regulatory compliance based upon the efforts of\"facilitation committees.\"The Panda is, in effect, not only patriotic toward his country which feeds him bamboo, but also the guardian of\"Blockchain with Panda Characteristics.\"\n\n\n    Panda Community’s  principle is to reward contributions,  to promote innovations and to ensure sustainability.\n\n\n    For Developers:\n\n\n    Panda foundation always  supports freeware and open source society；\n\n    Panda’s free blockchain development course already have 500 graduates, and will remain free in the future. Our goal is to help 30,000+ dedicated talents becoming senior blockchain developers. The market needs at least 80,000 of them now, and the course will keep going;\n\n    API and SDK will be free for the community, and a technical support team will be there to help;\n\n    Contributors of Panda-funded projects will be rewarded by cash or token, depending on the projects’ funding method;\n\n    All Panda-funded projects will be open to the community, be our guest and be proud to code on a beach;\n\n    All developers could publish their ware on Panda Dappstore. Indie developers will never be charged;\n\n    Copyrights to be protected by smart contracts and royalties would be settled to right-holders automatically.\n\n\n    For Users:\n\n\n    We believe in Robinhood-ism, we charge Fortune-500s and governments of developed countries to support the society;\n\n    Wares will remain free for charities, students and vulnerable groups;\n\n    Individual users contributed in promotion, feedback, community operation and so on would be rewarded by token;\n\n    Please send us your ideas.\n\n\n    The world needs real heroes, those dare to steal fire from above and to fight the power with gigantic drills. Panda is to be their men-behind-chairs, and you are to put on the cape.\n\n\n    So come on you apes, do you wanna live forever? ","addition":"* Language: English\n* Audience: Freeware community, open-source community, blockchain developer, Dapp\n* Difficulty: Skilled / 中階"}},"tracks":{"blockchain":{"group":"blockchain","track":"blockchain","communities":["blockchain"],"room":"IB302","title":"Blockchain"}},"speakers":{"YUAN Xun":{"speaker":"YUAN Xun","name":"YUAN Xun","intro":"Yuan Xun (辕询) is a lecturer and computational subcontractor. In the past, he has served as primary lecturer of Distributed Autonomous Coalition of Asia (DACA) and as advisor-in-residence at the iCenter of Tsinghua University. He was a core developer of Kraken and the translator of the initial whitepaper of Elastos. Mr Yuan is the originator of Concise Yuan (XCY), a simplified version of Bitcoin (BTC) which students learned to implement as part of DACA's acclaimed 6-8 week training program. ","link":"","avatar":null}},"communities":{}}