{"talks":{"social-innovation":{"talk":"social-innovation","track":"misc101","speakers":["Audrey Tang"],"begin":"2018-08-11T09:05:00+08:00","end":"2018-08-11T09:20:00+08:00","title":"Open Source ・ Social Innovation ","intro":"When we see “internet of things”, let’s make it an internet of beings.\nWhen we see “virtual reality”, let’s make it a shared reality.\nWhen we see “machine learning”, let’s make it collaborative learning.\nWhen we see “user experience”, let’s make it about human experience.\nWhen we hear “the singularity is near”, let us remember: the Plurality is here. ","addition":"* Audience: Everyone","language":"English","difficulty":"Begineer / 入門"}},"tracks":{"misc101":{"group":"misc","track":"misc101","communities":["coscup"],"room":"IB101","title":"Misc."}},"speakers":{"Audrey Tang":{"speaker":"Audrey Tang","name":"Audrey Tang","intro":"Audrey Tang, a civic hacker and Taiwan’s Digital Minister in charge of Social Entrepreneurship, is known for revitalizing global open source communities such as Perl and Haskell.\nIn the public sector, Audrey served on Taiwan national development council’s open data committee and K-12 curriculum committee; and led the country’s first e-Rulemaking project.\nIn the private sector, Audrey worked as a consultant with Apple on computational linguistics, with Oxford University Press on crowd lexicography, and with Socialtext on social interaction design.\nIn the social sector, Audrey actively contributes to Taiwan’s g0v (“gov-zero”), a vibrant community focusing on creating tools for the civil society, with the call to “fork the government”.","link":"","avatar":"/assets/s00045-1VEGbOx3vCeFmaaweBUSx25WK7XGqM7jb.png"}},"communities":{"coscup":{"community":"coscup","title":"COSCUP","intro":"COSCUP is an annual conference held by Taiwanese Open source community participants since 2006. It's a major force of Free software movement advocacy in Taiwan. The event is often held with talks, sponsor and communities booths, and Birds of a feather. In addition to international speakers, many Taiwanese local Open Source contributors often give their talks here.\n\nThe chief organizer, staffs, and speakers are all volunteers.","link":"https://coscup.org","image":null}}}