{"talks":{"state-of-cjk-issues-of-libreoffice":{"talk":"state-of-cjk-issues-of-libreoffice","track":"opensuse304","speakers":["Shinji Enoki\n榎 真治"],"begin":"2018-08-12T11:30:00+08:00","end":"2018-08-12T12:00:00+08:00","title":"State of CJK issues of LibreOffice ","intro":"The LibreOffice project is an aimed at multilingualism, as stated in The Document Foundation's\"Our Values\"of\"Our Next Decade Manifesto\" that anyone can translate so that everyone can use it in their mother tongue. \nHowever, LibreOffice developers are mostly in Europe, and in order to use them conveniently in other languages, those who understand those languages ​​need to solve the problem. LibreOffice 's CJK and problems unique to the Japanese environment are various such as vertical writing, external characters, phonetic, currency and date notation. \nSometimes CJK regression bugs occur in the LibreOffice project. It is important to strengthen user's feedback loop approach. However, I would like to find regression bugs by testing. \nIn last year's talk, I organized mainly examples of concrete CJK bugs. In this year's talk, As the first, I will analyze the bug database and introduce the trend. Secondly, I will organize major CJK bug cases. Thirdly, I will discuss how to test CJK functionality to find bugs before release. ","addition":"","language":"English","difficulty":"Skilled / 中階"}},"tracks":{"opensuse304":{"group":"opensuse","track":"opensuse304","communities":["opensuse"],"room":"IB304","title":"openSUSE.Asia Summit"}},"speakers":{"Shinji Enoki\n榎 真治":{"speaker":"Shinji Enoki\n榎 真治","name":"Shinji Enoki\n榎 真治","intro":"Shinji Enoki is a member of LibreOffice Japanese Team.\nHe focuses on planning of events and sometimes on QA activities e.g. bug triage.\nHis other community activities is a chairperson of Japan UNIX Society,\na member of Kyoto OpenData Community and a staff of KANSAI OPEN SOURCE.\nHe is freelance, and he is developing LibreOffice support business\nwith iCRAFT Corp.","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"","link":"","image":null}}}