{"talks":{"supporting-miracast-on-the-gnome-desktop":{"talk":"supporting-miracast-on-the-gnome-desktop","track":"gnome301","speakers":["Benjamin Berg"],"begin":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:45:00+08:00","title":"Supporting Miracast on the GNOME Desktop","intro":"Miracast is a standard to stream video and audio through WiFi connections to TVs and other displays. The most popular streaming solutions, Apple Airplay and Chromecast, are closed source implementations which do not integrate reliably with Free software. With Miraclecast, we have an open source solution which could receive a stream from all of your Linux devices. For example, it can be used to stream a video over WiFi to a Raspberry Pi. We are working on solving the sender side issue and a solution that allows casting to a Miracast device easily from the GNOME Desktop. In this talk, we will discuss the current status of the integration and the required changes in the underlying system components. ","addition":"","language":"English","difficulty":"Skilled / 中階","audience":"Users and interested people"}},"tracks":{"gnome301":{"group":"gnome","track":"gnome301","communities":["gnome"],"room":"IB301","title":"GNOME.Asia Summit"}},"speakers":{"Benjamin Berg":{"speaker":"Benjamin Berg","name":"Benjamin Berg","intro":"Benjamin is an electrical engineer who has is involved with GNOME helping on various parts of the desktop and also organising the 2016 GNOME Conference GUADEC. Currently he is working on hardware enablement at Red Hat in the Desktop Team.","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"gnome":{"community":"gnome","title":"GNOME.Asia Summit","intro":"GNOME.Asia Summit is the featured annual GNOME Conference in Asia. The event focuses primarily on the GNOME desktop, but also covers applications and the development platform tools. It brings together the GNOME community in Asia to provide a forum for users, developers, foundation leaders, governments and businesses to discuss the present technology and future developments.GNOME.Asia Summits have been held in Beijing, Ho-Chi-Minh City, Taipei, Bangalore, Hong Kong, Seoul, Beijing, Depok, New Delhi, Chongqing respectively over the last ten years. ","link":"https://www.gnome.asia","image":"/assets/logo.bd4e77b-1Js_Q9KUYpPeWdbkR0XLIl1zKCDrbH_jh.png"}}}