{"talks":{"the-dexon-network":{"talk":"the-dexon-network","track":"misc101","speakers":["Popo Chen"],"begin":"2018-08-11T16:40:00+0800","end":"2018-08-11T17:10:00+0800","title":"The DEXON Network - The Infrastructure of the Internet’s Decentralized Future ","intro":"Current blockchain technology suffers from transaction latency, high transaction cost and centralized limitations. The new generation blockchain technology uses parallel blockchain systems that work together to form an infinitely scalable, low-latency decentralized transaction processing engine. This will resolve the existing pain points today and upgrade blockchain technology to the next level with mass adoption to all. ","addition":"* Language: 漢語 / Mandarin Chinese\n* Audience: Software Engineers interested in blockchain era\n* Difficulty: Begineer / 入門"}},"tracks":{"misc101":{"group":"misc","track":"misc101","communities":["coscup"],"room":"IB101","title":"Misc."}},"speakers":{"Popo Chen":{"speaker":"Popo Chen","name":"Popo Chen","intro":"Popo is a 27-year-old serial entrepreneur with several successful exits. He founded 17 Media, a leading live streaming platform across Asia, and cashed-out at a 200M USD valuation in 2 years. He also founded COBINHOOD, the cryptocurrency service platform for the blockchain era which launched the world’s first zero trading fee cryptocurrency exchange, ranking top-30 in terms of global trading volume. With his eyes set on materializing the future-proof infrastructure of the decentralized internet, he also founded DEXON Foundation, an organization which leads the development of the infinitely scalable decentralized technology, the DEXON network.","link":"","avatar":null}},"communities":{"coscup":{"community":"coscup","title":"COSCUP","intro":"COSCUP is an annual conference held by Taiwanese Open source community participants since 2006. It's a major force of Free software movement advocacy in Taiwan.\nThe event is often held with talks, sponsor and communities booths, and Birds of a feather. In addition to international speakers, many Taiwanese local Open Source contributors often give their talks here.\nThe chief organizer, staffs, and speakers are all volunteers.","link":"https://coscup.org","image":null}}}