{"talks":{"using-inkscape-to-design-shoes":{"talk":"using-inkscape-to-design-shoes","track":"gnome306","speakers":["Iwan S. Tahari"],"begin":"2018-08-12T11:15:00+08:00","end":"2018-08-12T12:00:00+08:00","title":"USING INKSCAPE TO DESIGN SHOES ","intro":"Learn how Fans shoes manufacture use Free Open Source Drawing Software - Inkscape to design shoes. This presentation will explain the process from early stage of drawing the shoes with Inkscape until the final result. In addition, the presentation will show some of marketing items that are designed with Inkscape and GIMP. Inkscape is professional quality vector graphics software which runs on Linux, Mac OS X and Windows desktop computers. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-gnome/%2Fcoscup18-gnome306-using-inkscape-to-design-shoes)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":"Students, Art Designer, Footware enthusiast"}},"tracks":{"gnome306":{"group":"gnome","track":"gnome306","communities":["gnome"],"room":"IB306","title":"GNOME.Asia Summit"}},"speakers":{"Iwan S. Tahari":{"speaker":"Iwan S. Tahari","name":"Iwan S. Tahari","intro":"Work as Director of Operations in Fans Shoes Manufacture. Company Migrator in utilizing FOSS. Speakers of GnomeAsia 2016,2017, Libreoffice Conference 2018, and several others local open source gathering. Active Contributor in local open source activities.","link":"","avatar":"/assets/s00032-1vRAhdQVSGx3WWrJW1n9oHNH5uhSDCWsO.png"}},"communities":{"gnome":{"community":"gnome","title":"GNOME.Asia Summit","intro":"GNOME.Asia Summit is the featured annual GNOME Conference in Asia. The event focuses primarily on the GNOME desktop, but also covers applications and the development platform tools. It brings together the GNOME community in Asia to provide a forum for users, developers, foundation leaders, governments and businesses to discuss the present technology and future developments.GNOME.Asia Summits have been held in Beijing, Ho-Chi-Minh City, Taipei, Bangalore, Hong Kong, Seoul, Beijing, Depok, New Delhi, Chongqing respectively over the last ten years. ","link":"https://www.gnome.asia","image":"/assets/logo.bd4e77b-1Js_Q9KUYpPeWdbkR0XLIl1zKCDrbH_jh.png"}}}