{"talks":{"why-get-involved":{"talk":"why-get-involved","track":"opensuse201","speakers":["Ana María Martínez Gómez"],"begin":"2018-08-11T10:00:00+08:00","end":"2018-08-11T10:30:00+08:00","title":"Why should you get involved in open source? ","intro":"Are you new to the open source community? Or you are not even sure if it could be something for you? I will tell you how I started as an open source contributor and what from my experience makes open source and openSUSE such as interesting option.\n\nI will provide some tips to give your first steps in the open source world. In this line, I will speak about mentoring programs, focusing on GSoC (Google Summer of Code), in which openSUSE participates and in which I personally have participated as a student, mentor and organisation admin. I will explain what this program is about and why it is important for openSUSE. I will show projects from last years and for everybody interested in participating I will cover who can apply and how to do so. Last but not least, I'll present examples of ideal projects to start contributing to, both inside and outside openSUSE. \n\n----\n[Collaborative notes on HackMD](https://hackmd.io/c/coscup18-opensuse/%2Fcoscup18-opensuse201-why-get-involved)","addition":"","language":"English","difficulty":"Begineer / 入門","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Ana María Martínez Gómez":{"speaker":"Ana María Martínez Gómez","name":"Ana María Martínez Gómez","intro":"Ana started at openSUSE as a Google Summer of Code student. She\nstudied Computer Science Engineering and Mathematics at university and\njust after finishing she started working at SUSE in the OBS frontend\nteam. She contributes to several open source projects inside and\noutside openSUSE. When she is not hacking you may find her painting,\ncooking or learning some German.","link":"","avatar":null}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}