{"talks":{"xdp":{"talk":"xdp","track":"opensuse201","speakers":["Gary Lin"],"begin":"2018-08-12T10:00:00+08:00","end":"2018-08-12T10:30:00+08:00","title":"XDP: Unleash The Power of Network Card ","intro":"In the recent years, eBPF is extended across several other fields besides networking in Linux kernel, such as tracing, security, and error injection, and eXpress Data Path (XDP) leads the attention back to networking. Previously, eBPF is used in the generic network stack, and XDP goes further to integrate eBPF into the network drivers. With XDP, it's possible to dynamically inspect the packets right after harvesting them from the network cards. This is especially useful when dealing with the DDoS attack because the packets from the attackers are useless to the whole system, and it's better to drop them as early as possible to save the processing power. Furthermore, the newly merged AF_XDP patch set allows the user to do the zero-copy access to the packets, and this could bring more performance improvement to the userspace program. In this talk, I'll introduce the concept of XDP, the related mechanisms, and the recent updates in Linux upstream. ","addition":"","language":"Mandarin","difficulty":"Skilled / 中階","audience":""}},"tracks":{"opensuse201":{"group":"opensuse","track":"opensuse201","communities":["opensuse"],"room":"IB201","title":"openSUSE.Asia Summit"}},"speakers":{"Gary Lin":{"speaker":"Gary Lin","name":"Gary Lin","intro":"Gary Lin is a SUSE engineer and long time linux user. He participated openSUSE\ngnome development and mainly focuses on UEFI related issues now.\n","link":"","avatar":"/assets/coscup-1A2gYj9iSEiiUXRUuW2quhoIP7LFgJvmh.png"}},"communities":{"opensuse":{"community":"opensuse","title":"openSUSE.Asia Summit","intro":"openSUSE.Asia Summit is one of the great events for openSUSE community (i.e., both contributors, and users) in Asia. Those who usually communicate online can get together from all over the world, talk face to face, and have fun. Members of the community will share their most recent knowledge, experiences, and learn FLOSS technologies surrounding openSUSE.\n\nThis event at Taipei is the fifth in openSUSE.Asia Summit. Following the first Asia Summit in Beijing 2014. The past Asia Summits have had participants from China, Taiwan, India, Indonesia, Japan, South Korea, and etc.","link":"https://events.opensuse.org/conference/summitasia18","image":"/assets/2018_openSUSE_Asia_Summit_logo-1zMh7cP5ZGgsk2CWkTnx-Oxm9z-z5QYEe.png"}}}